{"_path":"/blog/offbeat-chronicles","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Offbeat Chronicles","description":"If you wake up in the morning and see the sunrise, it may seem normal and ordinary because it happens every day. But if today is the last day of your life, you would see a beautiful, stunning and meaningful sunrise.","date":"2023-01-13","categories":["About me"],"tags":["English","BlockChain","Experience"],"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"If you wake up in the morning and see the sunrise, it may seem normal and ordinary because it happens every day. But if today is the last day of your life, you would see a beautiful, stunning and meaningful sunrise."}]},{"type":"element","tag":"h2","props":{"id":"blow-with-the-wind"},"children":[{"type":"text","value":"Blow with the wind"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are dense tropical rainforests, mountains, grasslands, oceans, glaciers, and deserts on Earth, as well as bustling cities, small towns with distinctive cultures, and various local cuisines. I enjoy different cultures, places, and living habits. I believe that people come to this world to experience life, try out different ways of living in different regions, experience the complexity of the world, and travel to different places around the world, constantly trying and enjoying life. If there are things I find interesting that I haven't done, I will regret it when I am 100 years old. Your time is limited."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"History is not determined, and no decisive force can guarantee that the future will be better or worse, it depends on our decisions and behaviors in the years and decades to come."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"However, no matter how the times develop, I hope 50 years from now I can tell my grandson the \"before\" stories: Pandemic, Digital Currency, Great Inflation, Unusual Heat, Famine, Chinese Space Station Space Race, Financial Crisis ..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"So I decided to write blogs to record this series of things I saw and encountered. I have been on earth to observe human beings for 20 years. I think that people come to this world to experience life, to experience the lifestyles of different regions, to experience all kinds of complexity in the world, to travel all over the world, to keep trying, to enjoy life, enjoy the world!"}]},{"type":"element","tag":"h2","props":{"id":"from-front-end-to-blockchain"},"children":[{"type":"text","value":"From front end to blockchain"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I was interested in cool animations and learned front-end development."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Later on, while I was walking on the street, I came across a blockchain meetup, where I first heard about Ethereum. After that, I researched almost all the information about blockchain online. And I began learning about blockchain technology. I love Bitcoin and Ethereum. I studied the consensus algorithm of Bitcoin and Ethereum, and also invested in Eth and Dot. At that time, it was in the bull market of 2020. It's fantastic! I wrote about my experience in detail in a blog titled "},{"type":"element","tag":"a","props":{"href":"https://zur5z-byaaa-aaaag-aaxeq-cai.ic0.app/blog/%E4%B8%AD%E5%AD%90%E6%98%9FPRO","rel":["nofollow"]},"children":[{"type":"text","value":"NeutronStar Notes"}]},{"type":"text","value":", but it is in Chinese and needs to be translated with a browser."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2021, I started to learn Rust because of blockchain. I really like the open-source books in the Rust community, they have helped me a lot. I am currently primarily using Rust to build Dapps."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I was amazed at the IC of dfinity. In November 2021, I signed up for the China hackathon held by dfinity and started to learn to develop projects on IC. I have met many friends in the IC community, they are very enthusiastic to answer my questions and provide help, Mike, Lydia, lshoo, Peter ... The webpage I made for Lydia looks like this, it is not adapted to the mobile, and it can be viewed on the PC ~"}]},{"type":"element","tag":"img","props":{"src":"https://s1.imagehub.cc/images/2023/01/14/41cd8f2164adbb822b96afa2e8ec71cc.jpeg","style":"zoom:17%;"},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"After finishing this, I started to conceive an "},{"type":"element","tag":"a","props":{"href":"https://github.com/NeutronStarLab","rel":["nofollow"]},"children":[{"type":"text","value":"IC NFT blog"}]},{"type":"text","value":". The blog is stored in the author's own canister. When publishing an article, it is sent to the community's canister, and then the community canister sends it to readers for browsing; It is determined by a series of interactive data such as viewing time, page views, number of likes, comments, etc."}]},{"type":"element","tag":"img","props":{"src":"https://s1.imagehub.cc/images/2023/01/14/ca019e8a0d59eb702d7c51bbf77f6604.png","style":"zoom:80%;"},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Now I will continue to learn about blockchain."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Just like people in 1990 discussing what is the Internet: “ Internet? Isn't it just connecting several computers with network cables? similar to telephones and telegrams ~ it is used for long-distance communication! ”"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Web3 is beyond your imagination, there are a ten thousand Web3 in a thousand people's eyes!"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It is too early to define Web3, let us wait and see and witness this history together!"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"However, what can be seen so far is that Web3 is based on blockchain and returns data ownership to users without being controlled by others. Large companies cannot monopolize user data. Web3 is more fair, without middlemen and big companies sucking blood, and can return benefits to content creators and users. Everyone can build the Internet together and decide the future development direction (governance through voting)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I think IC is very much in line with my vision of the next generation supporting Web3 blockchain, just like the relationship between Ethereum and Bitcoin. IC can do many applications that ETH cannot do, and IC has made great innovations in blockchain. Most of the other chains are similar to Ethereum, so they cannot defeat ETH, they can only be servants of ETH."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Only subversive innovation can replace ETH, and small repairs and small repairs will not work. So I sold bitcoin and ethereum and bought ICP at 5.5~3.6 USD."}]},{"type":"element","tag":"img","props":{"src":"https://s1.imagehub.cc/images/2023/01/14/bf1a5b1cc2ac44d10c51b7e3dae9955e.jpeg","style":"zoom:25%;"},"children":[]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"IC nodes are in the computer room of a large data center. Ordinary small computers cannot be used as nodes. It is not as wasteful as BTC, and finally there is a tendency to return to centralization: various BTC mining pools merge mining machines together to mine, so that In the future, the originally very decentralized network has been merged into several large nodes (mines). So you see, BTC cannot achieve more and more “ decentralization ” ."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In general, the degree of decentralization, the speed of reaching consensus, and security are similar to an impossible triangle where only two of the three items can be achieved. It is impossible to do all three very well, and there must be a compromise. IC can balance these 3 points very well (although decentralization is not thorough enough to achieve these 3 points perfectly, but it balances these 3 points very well)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nodes who want to become IC need to pass NNS audit, which is like transforming from distributed to decentralized, avoiding the extremes of eos, and also a bit like alliance chain. (but it is much more complicated than the alliance chain, because the transformation of the alliance chain became a public chain) The IC may integrate the advantages of various chains."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Consensus relies on random selection of nodes. It randomly selects a few nodes among all nodes to reach consensus and generate blocks. As long as the random algorithm is used to generate enough randomness and cannot be predicted, fairness can be achieved."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Because the number of nodes selected by random lighthouse polling is small, the speed is also fast, and the front and rear ends can be deployed in jar containers. Can deploy large applications like Web2."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fewer but fine nodes and very high speed can greatly reduce costs, and there is no gas that is as expensive as ETH. And it can be expanded infinitely, adding more nodes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To become a node, a data center needs to buy a large amount of ICP as a deposit. If the data center does evil, the ICP will be fined."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When the ecology on IC becomes more and more prosperous, and more and more enterprises and organizations deploy decentralized application Dapps on IC, they need to burn ICP into Cycles to pay for the deployment of applications."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I believe IC is the future of blockchain."}]},{"type":"element","tag":"br","props":{},"children":[]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"blow-with-the-wind","depth":2,"text":"Blow with the wind"},{"id":"from-front-end-to-blockchain","depth":2,"text":"From front end to blockchain"}]}},"_type":"markdown","_id":"content:blog:Offbeat-Chronicles.md","_source":"content","_file":"blog/Offbeat-Chronicles.md","_stem":"blog/Offbeat-Chronicles","_extension":"md"}