[{"data":1,"prerenderedAt":900},["ShallowReactive",2],{"content-query-k2CphRQqGL":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"categories":11,"tags":13,"body":15,"_type":894,"_id":895,"_source":896,"_file":897,"_stem":898,"_extension":899},"/blog/guerillaopenaccessmanifesto","blog",false,"","游击队开放访问宣言(Guerilla Open Access Manifesto)","English   中文  日本   Français   Español   Italiano   Pусский   Português   Deutsch   한국어","2023-06-20",[12],"Ponder on the world",[14],"Future dreamer",{"type":16,"children":17,"toc":891},"root",[18,25,32,37,42,47,52,57,62,66,71,76,81,86,91,96,99,104,109,112,115,120,125,130,135,140,145,148,153,158,163,168,173,178,181,185,190,193,196,202,207,212,217,222,227,232,235,240,245,250,255,260,265,268,273,278,281,284,290,295,300,305,310,315,320,323,328,333,338,343,348,353,356,360,365,368,371,377,382,387,392,397,402,407,410,415,420,425,430,435,440,443,447,452,455,458,464,469,474,479,484,489,494,497,502,507,512,517,522,527,530,534,539,542,545,551,556,561,566,571,576,581,584,589,594,599,604,609,614,617,622,627,630,633,639,644,649,654,659,664,669,672,677,682,687,692,697,702,705,709,714,717,720,725,730,735,740,745,750,755,758,763,768,773,778,783,788,791,795,800,803,806,812,817,822,827,832,837,842,845,850,855,860,865,870,875,878,883,888],{"type":19,"tag":20,"props":21,"children":22},"element","p",{},[23],{"type":24,"value":9},"text",{"type":19,"tag":26,"props":27,"children":29},"h1",{"id":28},"guerilla-open-access-manifesto",[30],{"type":24,"value":31},"Guerilla Open Access Manifesto",{"type":19,"tag":20,"props":33,"children":34},{},[35],{"type":24,"value":36},"Information is power. But like all power, there are those who want to keep it for themselves. The world's entire scientific and cultural heritage, published over centuries in books and journals, is increasingly being digitized and locked up by a handful of private corporations. Want to read the papers featuring the most famous results of the sciences? You'll need to send enormous amounts to publishers like Reed Elsevier.",{"type":19,"tag":20,"props":38,"children":39},{},[40],{"type":24,"value":41},"There are those struggling to change this. The Open Access Movement has fought valiantly to ensure that scientists do not sign their copyrights away but instead ensure their work is published on the Internet, under terms that allow anyone to access it. But even under the best scenarios, their work will only apply to things published in the future.",{"type":19,"tag":20,"props":43,"children":44},{},[45],{"type":24,"value":46},"Everything up until now will have been lost.",{"type":19,"tag":20,"props":48,"children":49},{},[50],{"type":24,"value":51},"That is too high a price to pay. Forcing academics to pay money to read the work of their colleagues? Scanning entire libraries but only allowing the folks at Google to read them? Providing scientific articles to those at elite universities in the First World, but not to children in the Global South? It's outrageous and unacceptable.",{"type":19,"tag":20,"props":53,"children":54},{},[55],{"type":24,"value":56},"\"I agree,\" many say, \"but what can we do? The companies hold the copyrights, they make enormous amounts of money by charging for access, and it's perfectly legal — there's nothing we can do to stop them.\" But there is something we can, something that's already being done: we can fight back.",{"type":19,"tag":20,"props":58,"children":59},{},[60],{"type":24,"value":61},"Those with access to these resources — students, librarians, scientists — you have been given a privilege. You get to feed at this banquet of knowledge while the rest of the world is locked out. But you need not — indeed, morally, you cannot — keep this privilege for yourselves. You have a duty to share it with the world. And you have: trading passwords with colleagues, filling download requests for friends.",{"type":19,"tag":63,"props":64,"children":65},"br",{},[],{"type":19,"tag":20,"props":67,"children":68},{},[69],{"type":24,"value":70},"Meanwhile, those who have been locked out are not standing idly by. You have been sneaking through holes and climbing over fences, liberating the information locked up by the publishers and sharing them with your friends.",{"type":19,"tag":20,"props":72,"children":73},{},[74],{"type":24,"value":75},"But all of this action goes on in the dark, hidden underground. It's called stealing or piracy, as if sharing a wealth of knowledge were the moral equivalent of plundering a ship and murdering its crew. But sharing isn't immoral — it's a moral imperative. Only those blinded by greed would refuse to let a friend make a copy.",{"type":19,"tag":20,"props":77,"children":78},{},[79],{"type":24,"value":80},"Large corporations, of course, are blinded by greed. The laws under which they operate require it — their shareholders would revolt at anything less. And the politicians they have bought off back them, passing laws giving them the exclusive power to decide who can make copies.",{"type":19,"tag":20,"props":82,"children":83},{},[84],{"type":24,"value":85},"There is no justice in following unjust laws. It's time to come into the light and, in the grand tradition of civil disobedience, declare our opposition to this private theft of public culture.",{"type":19,"tag":20,"props":87,"children":88},{},[89],{"type":24,"value":90},"We need to take information, wherever it is stored, make our copies and share them with the world. We need to take stuff that's out of copyright and add it to the archive. We need to buy secret databases and put them on the Web. We need to download scientific journals and upload them to file sharing networks. We need to fight for Guerilla Open Access.",{"type":19,"tag":20,"props":92,"children":93},{},[94],{"type":24,"value":95},"With enough of us, around the world, we'll not just send a strong message opposing the privatization of knowledge — we'll make it a thing of the past. Will you join us?",{"type":19,"tag":63,"props":97,"children":98},{},[],{"type":19,"tag":20,"props":100,"children":101},{},[102],{"type":24,"value":103},"Aaron Swartz",{"type":19,"tag":20,"props":105,"children":106},{},[107],{"type":24,"value":108},"July 2008, Eremo, Italy",{"type":19,"tag":63,"props":110,"children":111},{},[],{"type":19,"tag":63,"props":113,"children":114},{},[],{"type":19,"tag":26,"props":116,"children":118},{"id":117},"游击队开放访问宣言",[119],{"type":24,"value":117},{"type":19,"tag":20,"props":121,"children":122},{},[123],{"type":24,"value":124},"信息就是力量。正如所有力量一样，总有人希望将它据为己有。这个世上的全部科学文化遗产，它们历经百年通过书籍期刊这样的纸质传承下来，现在却因为数字化而被一小部分私人组织据为己有。你想要获取到科学界最重要的知识吗？那就向 Reed Elsevier （世界知名的出版集团）支付高额的费用吧。",{"type":19,"tag":20,"props":126,"children":127},{},[128],{"type":24,"value":129},"有一些人立志改变现状，开放访问运动（Open Access Movement）就是为了阻止科学家们放弃他们的版权、并说服他们将研究成果公布在互联网上，任何人都可以获取到这些知识。但即使一切顺利，我们也只能看到未来要出版的内容，而至今所有的文献我们都无法看到。",{"type":19,"tag":20,"props":131,"children":132},{},[133],{"type":24,"value":134},"看到这些文献所要付出的价格太过高昂，这是在强迫研究人员付钱去看他们的同事的研究成果。将所有图书馆的书都扫描了，结果只允许 Google 的员工阅览？给世界一流大学提供科学文献，那贫困地区的小孩怎么办？这个现状简直不可理喻让人无法接受。",{"type":19,"tag":20,"props":136,"children":137},{},[138],{"type":24,"value":139},"很多人都说他们也觉得这是不合理的，“ 但是我们能做什么？那些大公司垄断了版权，他们通过收取费用赚得盆满钵满，而这，是完全合法的。我们对此无能为力 ” 。他们错了，我们还能做一件事，而且这是我们正在做的：反击。",{"type":19,"tag":20,"props":141,"children":142},{},[143],{"type":24,"value":144},"学生、图书管理员还有科学家们，你们都可以获取到这些资源，当世界上其他人都被知识拒之门外时，你们正在这片海洋里徜徉。真的，从道德上，你不需要也不应该自私地占有这项特权。你有责任把知识共享给这个世界。而你们也在做呀，和同事交换密码，帮朋友下载资料。",{"type":19,"tag":63,"props":146,"children":147},{},[],{"type":19,"tag":20,"props":149,"children":150},{},[151],{"type":24,"value":152},"在此期间，被挡在门外的人们也不曾呆立原地。你们穿过重重障碍，将那些曾被牢牢紧锁的知识共享给你们的朋友。",{"type":19,"tag":20,"props":154,"children":155},{},[156],{"type":24,"value":157},"但是这些行为却被称为 “ 盗窃 ” 或者 “ 盗版 ” ，好像共享知识能够和抢了一艘船或者杀了一头牛能划上等号似的。但是我们不可以谴责 “ 分享 ” ，这是一个有道德的行为。只有那些被贪婪蒙蔽的人们才会拒绝与朋友分享。",{"type":19,"tag":20,"props":159,"children":160},{},[161],{"type":24,"value":162},"大公司，当然被贪婪蒙蔽了双眼。法律保护着他们，股东更是受不了一分损失。而政客，哼。",{"type":19,"tag":20,"props":164,"children":165},{},[166],{"type":24,"value":167},"在不公正的法律中何来公正而言。是时候让我们的行动曝光，用非暴力反抗的传统，申明我们与那些占有公共资源的小偷们对立的立场了。",{"type":19,"tag":20,"props":169,"children":170},{},[171],{"type":24,"value":172},"我们需要获取知识，无论它在何方，我们都要得到它并将之传播开来。我们要将没有版权的资料收集起来，并归档。我们需要购买安全的数据库存放它们，将它们放到 Web 上。我们要下载科学期刊，再将它们共享出去。我们需要为游击队开放访问奋斗。",{"type":19,"tag":20,"props":174,"children":175},{},[176],{"type":24,"value":177},"只要我们拥有足够的力量，我们能做的就不仅仅是向知识私有化呐喊，而是可以真正改变不可理喻的现状，你愿意，加入我们吗？",{"type":19,"tag":63,"props":179,"children":180},{},[],{"type":19,"tag":20,"props":182,"children":183},{},[184],{"type":24,"value":103},{"type":19,"tag":20,"props":186,"children":187},{},[188],{"type":24,"value":189},"7 月 2008 年，Eremo，意大利",{"type":19,"tag":63,"props":191,"children":192},{},[],{"type":19,"tag":63,"props":194,"children":195},{},[],{"type":19,"tag":26,"props":197,"children":199},{"id":198},"ゲリラオープンアクセス宣言",[200],{"type":24,"value":201},"ゲリラ・オープンアクセス宣言",{"type":19,"tag":20,"props":203,"children":204},{},[205],{"type":24,"value":206},"情報は力です。しかし、すべての力と同様に、それを独占しようとする者たちがいます。何世紀にもわたって書籍や雑誌に発表されてきた世界の科学と文化の遺産は、徐々にデジタル化され、一握りの民間企業によって閉ざされつつあります。最も有名な科学研究の論文を読みたいですか？リード・エルゼビアなどの出版社に莫大な金額を支払う必要があります。",{"type":19,"tag":20,"props":208,"children":209},{},[210],{"type":24,"value":211},"これを変えようと奮闘している人たちがいます。オープンアクセス運動は、科学者たちが著作権を譲渡せず、インターネット上で誰もがアクセスできる条件で研究成果を公開するように努力し続けています。しかし、最も良いシナリオでも、その努力は未来に発表されるものにしか適用されません。",{"type":19,"tag":20,"props":213,"children":214},{},[215],{"type":24,"value":216},"それまでのすべてが失われます。",{"type":19,"tag":20,"props":218,"children":219},{},[220],{"type":24,"value":221},"それはあまりにも高い代償です。同僚の研究を読むためにアカデミックなお金を払わせること？図書館全体をスキャンしても、Googleの人々だけがそれを読むことができるようにすること？第一世界のエリート大学の人々に科学論文を提供するが、世界南部の子供たちには提供しないこと？それは憤慨すべきで、容認できません。",{"type":19,"tag":20,"props":223,"children":224},{},[225],{"type":24,"value":226},"「同意する」と多くの人が言いますが、「私たちに何ができるのでしょうか？企業が著作権を保有しており、アクセス料を請求することで莫大な利益を上げており、それは完全に合法です。彼らを止める方法はありません」。しかし、私たちにできることがあります。すでに行われていることがあります：反撃することができます。",{"type":19,"tag":20,"props":228,"children":229},{},[230],{"type":24,"value":231},"これらのリソースにアクセスできる人々 - 学生、司書、科学者 - あなたは特権を与えられています。世界の多くの人々が閉ざされている間、知識の宴に参加することができます。しかし、あなたはこの特権を自分自身のために保持する必要はありません。そして、道義的には、あなたはそれをできません。それを世界と共有する義務があります。そして、あなたはそのようにしてきました：同僚とパスワードを交換し、友人のダウンロードリクエストに応えること。",{"type":19,"tag":63,"props":233,"children":234},{},[],{"type":19,"tag":20,"props":236,"children":237},{},[238],{"type":24,"value":239},"一方、閉ざされた人々はただ立ち尽くしていません。あなたは穴をくぐり抜け、フェンスを乗り越え、出版社によって閉ざされた情報を解放し、友人たちと共有してきました。",{"type":19,"tag":20,"props":241,"children":242},{},[243],{"type":24,"value":244},"しかし、この行動はすべて闇の中で、地下で隠れて行われています。それは盗みや海賊行為と呼ばれますが、知識の富を共有することが船を略奪し、乗組員を殺害することと道義的に同等であるかのように。しかし、共有は非道徳的ではありません。それは道徳的義務です。友人にコピーを作らせることを拒む者は、利益欲に目がくらんでいます。",{"type":19,"tag":20,"props":246,"children":247},{},[248],{"type":24,"value":249},"もちろん、大企業も利益欲に目がくらんでいます。彼らが運営する法律では、それが求められています。株主たちはそれ以下のことには反乱を起こすでしょう。そして、彼らが買収した政治家たちは彼らを支持し、コピーを誰が作成できるかを独占的に決定できる法律を制定しています。",{"type":19,"tag":20,"props":251,"children":252},{},[253],{"type":24,"value":254},"不正な法律に従う正義はありません。市民的不服従の偉大な伝統に従い、公的文化の私的窃盗に対する私たちの反対を宣言する時が来ました。",{"type":19,"tag":20,"props":256,"children":257},{},[258],{"type":24,"value":259},"情報がどこに保存されているかを探し出し、コピーを作成し、それを世界と共有する必要があります。著作権が切れたものをアーカイブに追加する必要があります。秘密のデータベースを購入し、ウェブに公開する必要があります。科学誌をダウンロードし、ファイル共有ネットワークにアップロードする必要があります。ゲリラ・オープンアクセスのために戦う必要があります。",{"type":19,"tag":20,"props":261,"children":262},{},[263],{"type":24,"value":264},"私たちが世界中で十分な数に達すれば、知識の民営化に対する強力なメッセージを送るだけでなく、それを過去のものにすることができます。あなたは私たちに加わりますか？",{"type":19,"tag":63,"props":266,"children":267},{},[],{"type":19,"tag":20,"props":269,"children":270},{},[271],{"type":24,"value":272},"アーロン・シュワルツ",{"type":19,"tag":20,"props":274,"children":275},{},[276],{"type":24,"value":277},"2008年7月、イタリア・エレモ",{"type":19,"tag":63,"props":279,"children":280},{},[],{"type":19,"tag":63,"props":282,"children":283},{},[],{"type":19,"tag":26,"props":285,"children":287},{"id":286},"manifeste-pour-laccès-ouvert-par-la-guérilla",[288],{"type":24,"value":289},"Manifeste pour l'accès ouvert par la guérilla",{"type":19,"tag":20,"props":291,"children":292},{},[293],{"type":24,"value":294},"L'information est un pouvoir. Mais comme tout pouvoir, il y a ceux qui veulent le garder pour eux-mêmes. L'ensemble du patrimoine scientifique et culturel du monde, publié au fil des siècles dans des livres et des revues, est de plus en plus numérisé et verrouillé par quelques grandes entreprises privées. Vous voulez lire les articles présentant les résultats les plus célèbres des sciences ? Vous devrez payer des sommes énormes à des éditeurs tels que Reed Elsevier.",{"type":19,"tag":20,"props":296,"children":297},{},[298],{"type":24,"value":299},"Il y a ceux qui luttent pour changer cela. Le mouvement de l'accès ouvert se bat vaillamment pour s'assurer que les scientifiques ne cèdent pas leurs droits d'auteur, mais garantissent plutôt que leur travail soit publié sur Internet, sous des conditions permettant à chacun d'y accéder. Mais même dans les meilleurs scénarios, leur travail ne s'appliquera qu'aux choses publiées à l'avenir.",{"type":19,"tag":20,"props":301,"children":302},{},[303],{"type":24,"value":304},"Tout ce qui a été fait jusqu'à présent sera perdu.",{"type":19,"tag":20,"props":306,"children":307},{},[308],{"type":24,"value":309},"C'est un prix trop élevé à payer. Forcer les universitaires à payer pour lire le travail de leurs collègues ? Numériser des bibliothèques entières mais n'autoriser que les employés de Google à les lire ? Fournir des articles scientifiques à ceux des universités d'élite du Premier Monde, mais pas aux enfants du Sud Global ? C'est scandaleux et inacceptable.",{"type":19,"tag":20,"props":311,"children":312},{},[313],{"type":24,"value":314},"\"Je suis d'accord\", disent beaucoup, \"mais que pouvons-nous faire ? Les entreprises détiennent les droits d'auteur, elles gagnent énormément d'argent en facturant l'accès, et c'est parfaitement légal - nous ne pouvons rien faire pour les arrêter.\" Mais il y a quelque chose que nous pouvons faire, quelque chose qui est déjà en cours : nous pouvons riposter.",{"type":19,"tag":20,"props":316,"children":317},{},[318],{"type":24,"value":319},"Ceux qui ont accès à ces ressources - étudiants, bibliothécaires, scientifiques - vous avez reçu un privilège. Vous avez la possibilité de vous nourrir de ce festin de connaissances tandis que le reste du monde en est exclu. Mais vous n'avez pas besoin - en réalité, moralement, vous ne pouvez pas - garder ce privilège pour vous-mêmes. Vous avez le devoir de le partager avec le monde. Et vous l'avez déjà fait : échange de mots de passe avec des collègues, satisfaction des demandes de téléchargement pour des amis.",{"type":19,"tag":63,"props":321,"children":322},{},[],{"type":19,"tag":20,"props":324,"children":325},{},[326],{"type":24,"value":327},"Pendant ce temps, ceux qui ont été exclus ne restent pas les bras croisés. Vous avez cherché des failles, escaladé des clôtures, libéré les informations verrouillées par les éditeurs et les avez partagées avec vos amis.",{"type":19,"tag":20,"props":329,"children":330},{},[331],{"type":24,"value":332},"Mais toutes ces actions se déroulent dans l'obscurité, cachées sous terre. On les appelle le vol ou la piraterie, comme si partager une richesse de connaissances était l'équivalent moral de piller un navire et de tuer son équipage. Mais le partage n'est pas immoral - c'est un impératif moral. Seuls ceux aveuglés par la cupidité refuseraient de laisser un ami faire une copie.",{"type":19,"tag":20,"props":334,"children":335},{},[336],{"type":24,"value":337},"Les grandes entreprises, bien sûr, sont aveuglées par la cupidité. Les lois selon lesquelles elles opèrent l'exigent - leurs actionnaires se révolteraient contre tout ce qui est moins. Et les politiciens qu'ils ont achetés les soutiennent, en promulguant des lois leur donnant le pouvoir exclusif de décider qui peut faire des copies.",{"type":19,"tag":20,"props":339,"children":340},{},[341],{"type":24,"value":342},"Il n'y a pas de justice à suivre des lois injustes. Il est temps de venir dans la lumière et, dans la grande tradition de la désobéissance civile, déclarer notre opposition à ce vol privé de la culture publique.",{"type":19,"tag":20,"props":344,"children":345},{},[346],{"type":24,"value":347},"Nous devons prendre l'information, où qu'elle soit stockée, faire nos copies et les partager avec le monde. Nous devons prendre ce qui est dans le domaine public et l'ajouter aux archives. Nous devons acheter des bases de données secrètes et les mettre sur le Web. Nous devons télécharger des revues scientifiques et les mettre en ligne sur des réseaux de partage de fichiers. Nous devons nous battre pour l'accès ouvert par la guérilla.",{"type":19,"tag":20,"props":349,"children":350},{},[351],{"type":24,"value":352},"Avec suffisamment d'entre nous, partout dans le monde, nous n'enverrons pas seulement un message fort contre la privatisation du savoir - nous en ferons une chose du passé. Nous rejoindrez-vous ?",{"type":19,"tag":63,"props":354,"children":355},{},[],{"type":19,"tag":20,"props":357,"children":358},{},[359],{"type":24,"value":103},{"type":19,"tag":20,"props":361,"children":362},{},[363],{"type":24,"value":364},"Juillet 2008, Eremo, Italie",{"type":19,"tag":63,"props":366,"children":367},{},[],{"type":19,"tag":63,"props":369,"children":370},{},[],{"type":19,"tag":26,"props":372,"children":374},{"id":373},"manifiesto-de-acceso-abierto-guerrillero",[375],{"type":24,"value":376},"Manifiesto de Acceso Abierto Guerrillero",{"type":19,"tag":20,"props":378,"children":379},{},[380],{"type":24,"value":381},"La información es poder. Pero, como todo poder, hay quienes quieren mantenerlo para sí mismos. Todo el patrimonio científico y cultural del mundo, publicado a lo largo de siglos en libros y revistas, está siendo cada vez más digitalizado y encerrado por un puñado de corporaciones privadas. ¿Quieres leer los artículos que presentan los resultados más famosos de las ciencias? Tendrás que enviar enormes sumas a editoriales como Reed Elsevier.",{"type":19,"tag":20,"props":383,"children":384},{},[385],{"type":24,"value":386},"Hay quienes luchan por cambiar esto. El Movimiento de Acceso Abierto ha luchado valientemente para asegurarse de que los científicos no cedan sus derechos de autor, sino que aseguren que su trabajo se publique en Internet, bajo términos que permitan que cualquiera pueda acceder a él. Pero incluso en los mejores escenarios, su trabajo solo se aplicará a cosas publicadas en el futuro.",{"type":19,"tag":20,"props":388,"children":389},{},[390],{"type":24,"value":391},"Todo lo realizado hasta ahora se habrá perdido.",{"type":19,"tag":20,"props":393,"children":394},{},[395],{"type":24,"value":396},"Ese es un precio demasiado alto a pagar. ¿Forzar a los académicos a pagar dinero para leer el trabajo de sus colegas? ¿Escanear bibliotecas enteras pero permitir que solo la gente de Google las lea? ¿Proporcionar artículos científicos a aquellos en universidades de élite en el Primer Mundo, pero no a los niños en el Sur Global? Es escandaloso e inaceptable.",{"type":19,"tag":20,"props":398,"children":399},{},[400],{"type":24,"value":401},"\"Estoy de acuerdo\", muchos dicen, \"pero ¿qué podemos hacer? Las empresas tienen los derechos de autor, ganan enormes sumas de dinero al cobrar por el acceso, y es perfectamente legal. No hay nada que podamos hacer para detenerlas\". Pero hay algo que podemos hacer, algo que ya se está haciendo: podemos contraatacar.",{"type":19,"tag":20,"props":403,"children":404},{},[405],{"type":24,"value":406},"Aquellos con acceso a estos recursos, estudiantes, bibliotecarios, científicos, se les ha dado un privilegio. Tienen la oportunidad de alimentarse de este banquete de conocimiento mientras el resto del mundo está excluido. Pero no es necesario, de hecho, moralmente, no pueden mantener este privilegio para ustedes mismos. Tienen el deber de compartirlo con el mundo. Y lo han hecho: intercambiando contraseñas con colegas, cumpliendo solicitudes de descarga para amigos.",{"type":19,"tag":63,"props":408,"children":409},{},[],{"type":19,"tag":20,"props":411,"children":412},{},[413],{"type":24,"value":414},"Mientras tanto, aquellos que han sido excluidos no se quedan de brazos cruzados. Han estado infiltrándose por agujeros y saltando cercas, liberando la información encerrada por las editoriales y compartiéndola con sus amigos.",{"type":19,"tag":20,"props":416,"children":417},{},[418],{"type":24,"value":419},"Pero toda esta acción ocurre en la oscuridad, oculta bajo tierra. Se le llama robo o piratería, como si compartir una riqueza de conocimiento fuera el equivalente moral de saquear un barco y asesinar a su tripulación. Pero compartir no es inmoral, es un imperativo moral. Solo aquellos cegados por la avaricia se negarían a permitir que un amigo haga una copia.",{"type":19,"tag":20,"props":421,"children":422},{},[423],{"type":24,"value":424},"Las grandes corporaciones, por supuesto, están cegadas por la avaricia. Las leyes bajo las cuales operan lo requieren; sus accionistas se rebelarían ante algo menos. Y los políticos a los que han sobornado los respaldan, promulgando leyes que les otorgan el poder exclusivo de decidir quién puede hacer copias.",{"type":19,"tag":20,"props":426,"children":427},{},[428],{"type":24,"value":429},"No hay justicia en seguir leyes injustas. Es hora de salir a la luz y, en la gran tradición de la desobediencia civil, declarar nuestra oposición a este robo privado de la cultura pública.",{"type":19,"tag":20,"props":431,"children":432},{},[433],{"type":24,"value":434},"Necesitamos tomar la información, dondequiera que esté almacenada, hacer nuestras copias y compartirlas con el mundo. Necesitamos tomar cosas que estén fuera del ámbito de los derechos de autor y agregarlas al archivo. Necesitamos comprar bases de datos secretas y ponerlas en la web. Necesitamos descargar revistas científicas y subirlas a redes de intercambio de archivos. Necesitamos luchar por el Acceso Abierto Guerrillero.",{"type":19,"tag":20,"props":436,"children":437},{},[438],{"type":24,"value":439},"Con suficientes personas en todo el mundo, no solo enviaremos un mensaje contundente en contra de la privatización del conocimiento, sino que lo convertiremos en algo del pasado. ¿Te unirás a nosotros?",{"type":19,"tag":63,"props":441,"children":442},{},[],{"type":19,"tag":20,"props":444,"children":445},{},[446],{"type":24,"value":103},{"type":19,"tag":20,"props":448,"children":449},{},[450],{"type":24,"value":451},"Julio de 2008, Eremo, Italia",{"type":19,"tag":63,"props":453,"children":454},{},[],{"type":19,"tag":63,"props":456,"children":457},{},[],{"type":19,"tag":26,"props":459,"children":461},{"id":460},"manifesto-per-laccesso-aperto-guerrilla",[462],{"type":24,"value":463},"Manifesto per l'Accesso Aperto Guerrilla",{"type":19,"tag":20,"props":465,"children":466},{},[467],{"type":24,"value":468},"L'informazione è potere. Ma come ogni potere, ci sono coloro che vogliono tenerlo per sé. L'intero patrimonio scientifico e culturale del mondo, pubblicato nel corso dei secoli in libri e riviste, sta sempre più venendo digitalizzato e imprigionato da una manciata di corporazioni private. Vuoi leggere gli articoli che presentano i risultati più famosi delle scienze? Dovrai inviare enormi somme agli editori come Reed Elsevier.",{"type":19,"tag":20,"props":470,"children":471},{},[472],{"type":24,"value":473},"Ci sono coloro che lottano per cambiare questa situazione. Il Movimento per l'Accesso Aperto ha combattuto valorosamente per assicurarsi che gli scienziati non cedano i loro diritti d'autore, ma garantiscano invece che il loro lavoro sia pubblicato su Internet, secondo termini che permettano a chiunque di accedervi. Ma anche nei migliori scenari, il loro lavoro si applicherà solo a ciò che verrà pubblicato in futuro.",{"type":19,"tag":20,"props":475,"children":476},{},[477],{"type":24,"value":478},"Tutto ciò che è stato fatto fino ad ora sarà andato perduto.",{"type":19,"tag":20,"props":480,"children":481},{},[482],{"type":24,"value":483},"Questo è un prezzo troppo alto da pagare. Costringere gli accademici a pagare denaro per leggere il lavoro dei loro colleghi? Digitalizzare intere biblioteche ma permettere solo alle persone di Google di leggerle? Fornire articoli scientifici a coloro che frequentano università di élite nel Primo Mondo, ma non ai bambini del Sud Globale? È scandaloso e inaccettabile.",{"type":19,"tag":20,"props":485,"children":486},{},[487],{"type":24,"value":488},"\"Molte persone sono d'accordo, ma cosa possiamo fare? Le aziende detengono i diritti d'autore, guadagnano enormi somme di denaro facendo pagare l'accesso, ed è perfettamente legale, non c'è niente che possiamo fare per fermarle\". Ma c'è qualcosa che possiamo fare, qualcosa che già sta avvenendo: possiamo reagire.",{"type":19,"tag":20,"props":490,"children":491},{},[492],{"type":24,"value":493},"Coloro che hanno accesso a queste risorse, studenti, bibliotecari, scienziati, vi è stato concesso un privilegio. Avete il privilegio di nutrirvi di questo banchetto di conoscenza mentre il resto del mondo è escluso. Ma non è necessario, anzi, moralmente, non potete mantenere questo privilegio per voi stessi. Avete il dovere di condividerlo con il mondo. E lo avete fatto: scambiando password con colleghi, soddisfacendo richieste di download per amici.",{"type":19,"tag":63,"props":495,"children":496},{},[],{"type":19,"tag":20,"props":498,"children":499},{},[500],{"type":24,"value":501},"Nel frattempo, coloro che sono stati esclusi non stanno rimanendo con le mani in mano. Vi siete introdotti furtivamente attraverso falle e avete superato recinzioni, liberando le informazioni imprigionate dagli editori e condividendole con i vostri amici.",{"type":19,"tag":20,"props":503,"children":504},{},[505],{"type":24,"value":506},"Ma tutta questa azione avviene nell'oscurità, nascosta sottoterra. Viene chiamato furto o pirateria, come se condividere una ricchezza di conoscenza fosse l'equivalente morale di saccheggiare una nave e uccidere il suo equipaggio. Ma condividere non è immorale, è un imperativo morale. Solo coloro accecati dall'avidità si rifiuterebbero di permettere a un amico di fare una copia.",{"type":19,"tag":20,"props":508,"children":509},{},[510],{"type":24,"value":511},"Le grandi corporazioni, naturalmente, sono accecate dall'avidità. Le leggi sotto cui operano lo richiedono: i loro azionisti si ribellerebbero a qualsiasi cosa di meno. E i politici che hanno corrotto li sostengono, approvando leggi che conferiscono loro il potere esclusivo di decidere chi può fare copie.",{"type":19,"tag":20,"props":513,"children":514},{},[515],{"type":24,"value":516},"Non c'è giustizia nel seguire leggi ingiuste. È ora di venire alla luce e, nella grande tradizione della disobbedienza civile, dichiarare la nostra opposizione a questo furto privato della cultura pubblica.",{"type":19,"tag":20,"props":518,"children":519},{},[520],{"type":24,"value":521},"Dobbiamo prendere le informazioni, ovunque siano conservate, fare le nostre copie e condividerle con il mondo. Dobbiamo prendere ciò che non è più coperto dai diritti d'autore e aggiungerlo all'archivio. Dobbiamo acquistare database segreti e metterli sul web. Dobbiamo scaricare riviste scientifiche e caricarle su reti di condivisione file. Dobbiamo combattere per l'Accesso Aperto Guerrilla.",{"type":19,"tag":20,"props":523,"children":524},{},[525],{"type":24,"value":526},"Con abbastanza persone in tutto il mondo, non invieremo solo un forte messaggio contrario alla privatizzazione della conoscenza, ma la renderemo un'idea del passato. Ti unirai a noi?",{"type":19,"tag":63,"props":528,"children":529},{},[],{"type":19,"tag":20,"props":531,"children":532},{},[533],{"type":24,"value":103},{"type":19,"tag":20,"props":535,"children":536},{},[537],{"type":24,"value":538},"Luglio 2008, Eremo, Italia",{"type":19,"tag":63,"props":540,"children":541},{},[],{"type":19,"tag":63,"props":543,"children":544},{},[],{"type":19,"tag":26,"props":546,"children":548},{"id":547},"манифест-герилья-открытого-доступа",[549],{"type":24,"value":550},"Манифест Герилья Открытого Доступа",{"type":19,"tag":20,"props":552,"children":553},{},[554],{"type":24,"value":555},"Информация - это сила. Но, как и всякая сила, есть те, кто хочет удержать ее при себе. Весь научно-культурный наследие мира, опубликованный в течение веков в книгах и журналах, все чаще становится объектом цифровизации и закрытия в ограниченном доступе несколькими частными корпорациями. Хотите прочитать статьи с самыми известными результатами научных исследований? Вам придется заплатить огромные суммы издателям, таким как Reed Elsevier.",{"type":19,"tag":20,"props":557,"children":558},{},[559],{"type":24,"value":560},"Есть те, кто борется за изменения этого положения. Движение Открытого Доступа смело борется, чтобы ученые не отказывались от своих авторских прав, а, наоборот, гарантировали публикацию своих работ в Интернете на условиях, позволяющих доступ к ним каждому. Но даже в лучших сценариях их работа будет применяться только к будущим публикациям.",{"type":19,"tag":20,"props":562,"children":563},{},[564],{"type":24,"value":565},"Все, что было сделано до сих пор, будет утрачено.",{"type":19,"tag":20,"props":567,"children":568},{},[569],{"type":24,"value":570},"Это слишком высокая цена, чтобы платить. Заставлять ученых платить деньги, чтобы прочитать работы своих коллег? Сканировать целые библиотеки, но позволять только сотрудникам Google читать их? Предоставлять научные статьи только элитным университетам в первом мире, но не детям в Глобальном Юге? Это возмутительно и неприемлемо.",{"type":19,"tag":20,"props":572,"children":573},{},[574],{"type":24,"value":575},"\"Я согласен,\" многие говорят, \"но что мы можем сделать? Компании владеют авторскими правами, они зарабатывают огромные деньги, взимая плату за доступ, и это абсолютно законно - ничего нельзя сделать, чтобы остановить их.\" Но есть то, что мы можем сделать, то, что уже делается: мы можем противостоять.",{"type":19,"tag":20,"props":577,"children":578},{},[579],{"type":24,"value":580},"Тем, кто имеет доступ к этим ресурсам - студентам, библиотекарям, ученым - дан привилегия. Вы можете питаться на этом пиршестве знаний, в то время как остальной мир исключен. Но вам не нужно, в действительности, морально вы не можете сохранять эту привилегию для себя. У вас есть обязанность поделиться ею с миром. И вы это делаете: обмениваетесь паролями с коллегами, отвечаете на запросы о загрузке для друзей.",{"type":19,"tag":63,"props":582,"children":583},{},[],{"type":19,"tag":20,"props":585,"children":586},{},[587],{"type":24,"value":588},"Тем временем, те, кто был исключен, не бездействуют. Вы проникаете сквозь дыры и перелезаете через заборы, освобождая информацию, запертую издателями, и делитесь ею с друзьями.",{"type":19,"tag":20,"props":590,"children":591},{},[592],{"type":24,"value":593},"Но вся эта активность происходит в темноте, скрытой под землей. Ее называют кражей или пиратством, будто бы совместное использование богатства знаний равноценно моральным преступлениям, таким как грабеж корабля и убийство экипажа. Но совместное использование не является аморальным - это моральная необходимость. Только те, ослепленные жадностью, откажутся разрешить другу сделать копию.",{"type":19,"tag":20,"props":595,"children":596},{},[597],{"type":24,"value":598},"Крупные корпорации, конечно же, ослеплены жадностью. Законы, в соответствии с которыми они действуют, требуют этого - их акционеры возмущались бы чем-то иным. И политики, которых они подкупили, поддерживают их, принимая законы, дающие им исключительную власть решать, кто может делать копии.",{"type":19,"tag":20,"props":600,"children":601},{},[602],{"type":24,"value":603},"Нет справедливости в следовании несправедливым законам. Пришло время выйти на свет и, великой традиции гражданского неповиновения, заявить о нашем противодействии этой частной краже общественной культуры.",{"type":19,"tag":20,"props":605,"children":606},{},[607],{"type":24,"value":608},"Нам нужно брать информацию там, где она хранится, делать копии и делиться ими с миром. Нам нужно брать материалы, не охраняемые авторским правом, и добавлять их в архив. Нам нужно покупать секретные базы данных и размещать их в сети Интернет. Нам нужно скачивать научные журналы и загружать их в сети обмена файлами. Мы должны бороться за Герилья Открытого Доступа.",{"type":19,"tag":20,"props":610,"children":611},{},[612],{"type":24,"value":613},"С достаточным числом нас по всему миру мы не только отправим сильное сообщение, противодействуя приватизации знаний, - мы сделаем это явлением прошлого. Присоединитесь к нам?",{"type":19,"tag":63,"props":615,"children":616},{},[],{"type":19,"tag":20,"props":618,"children":619},{},[620],{"type":24,"value":621},"Аарон Сварц",{"type":19,"tag":20,"props":623,"children":624},{},[625],{"type":24,"value":626},"Июль 2008, Эремо, Италия",{"type":19,"tag":63,"props":628,"children":629},{},[],{"type":19,"tag":63,"props":631,"children":632},{},[],{"type":19,"tag":26,"props":634,"children":636},{"id":635},"manifesto-da-acesso-aberto-guerilla",[637],{"type":24,"value":638},"Manifesto da Acesso Aberto Guerilla",{"type":19,"tag":20,"props":640,"children":641},{},[642],{"type":24,"value":643},"A informação é poder. Mas, como todo poder, há aqueles que desejam mantê-lo para si mesmos. Todo o patrimônio científico e cultural do mundo, publicado ao longo dos séculos em livros e periódicos, está cada vez mais sendo digitalizado e mantido sob controle de um punhado de corporações privadas. Quer ler os artigos com os resultados mais famosos das ciências? Você precisará enviar quantias enormes para editoras como a Reed Elsevier.",{"type":19,"tag":20,"props":645,"children":646},{},[647],{"type":24,"value":648},"Existem aqueles que lutam para mudar isso. O Movimento de Acesso Aberto tem lutado valentemente para garantir que os cientistas não cedam seus direitos autorais, mas sim garantam que seu trabalho seja publicado na Internet, sob termos que permitam a todos acessá-lo. No entanto, mesmo nos melhores cenários, seu trabalho se aplicará apenas às coisas publicadas no futuro.",{"type":19,"tag":20,"props":650,"children":651},{},[652],{"type":24,"value":653},"Tudo até agora terá sido perdido.",{"type":19,"tag":20,"props":655,"children":656},{},[657],{"type":24,"value":658},"Isso é um preço muito alto a pagar. Forçar acadêmicos a pagar para ler o trabalho de seus colegas? Digitalizar bibliotecas inteiras, mas permitir apenas que os funcionários do Google as leiam? Fornecer artigos científicos para as elites das universidades do Primeiro Mundo, mas não para as crianças do Sul Global? Isso é ultrajante e inaceitável.",{"type":19,"tag":20,"props":660,"children":661},{},[662],{"type":24,"value":663},"\"Muitos concordam\", dizem, \"mas o que podemos fazer? As empresas detêm os direitos autorais, elas ganham enormes quantias de dinheiro cobrando pelo acesso, e é perfeitamente legal - não podemos fazer nada para impedi-las.\" Mas há algo que podemos fazer, algo que já está sendo feito: podemos revidar.",{"type":19,"tag":20,"props":665,"children":666},{},[667],{"type":24,"value":668},"Aqueles que têm acesso a esses recursos - estudantes, bibliotecários, cientistas - receberam um privilégio. Vocês têm o privilégio de se alimentar deste banquete de conhecimento enquanto o resto do mundo fica excluído. Mas vocês não precisam - na verdade, moralmente, não podem - manter esse privilégio apenas para vocês. Vocês têm o dever de compartilhá-lo com o mundo. E vocês têm feito isso: trocando senhas com colegas, atendendo a pedidos de download de amigos.",{"type":19,"tag":63,"props":670,"children":671},{},[],{"type":19,"tag":20,"props":673,"children":674},{},[675],{"type":24,"value":676},"Enquanto isso, aqueles que foram excluídos não estão ficando de braços cruzados. Vocês têm se infiltrado por buracos e escalado cercas, libertando as informações mantidas pelos editores e compartilhando-as com seus amigos.",{"type":19,"tag":20,"props":678,"children":679},{},[680],{"type":24,"value":681},"Mas todas essas ações ocorrem na escuridão, ocultas no subterrâneo. Isso é chamado de roubo ou pirataria, como se compartilhar uma riqueza de conhecimento fosse equivalente moral ao saquear um navio e assassinar sua tripulação. Mas compartilhar não é imoral - é um imperativo moral. Somente aqueles cegados pela ganância se recusariam a permitir que um amigo fizesse uma cópia.",{"type":19,"tag":20,"props":683,"children":684},{},[685],{"type":24,"value":686},"As grandes corporações, é claro, são cegadas pela ganância. As leis sob as quais elas operam exigem isso - seus acionistas se revoltariam com qualquer coisa menos. E os políticos que elas compraram as apoiam, aprovando leis que lhes dão o poder exclusivo de decidir quem pode fazer cópias.",{"type":19,"tag":20,"props":688,"children":689},{},[690],{"type":24,"value":691},"Não há justiça em seguir leis injustas. É hora de vir para a luz e, na grande tradição da desobediência civil, declarar nossa oposição a esse roubo privado da cultura pública.",{"type":19,"tag":20,"props":693,"children":694},{},[695],{"type":24,"value":696},"Precisamos pegar informações, onde quer que estejam armazenadas, fazer nossas cópias e compartilhá-las com o mundo. Precisamos pegar coisas que estão fora dos direitos autorais e adicioná-las ao arquivo. Precisamos comprar bancos de dados secretos e colocá-los na Web. Precisamos baixar periódicos científicos e fazer upload deles em redes de compartilhamento de arquivos. Precisamos lutar pelo Acesso Aberto Guerilla.",{"type":19,"tag":20,"props":698,"children":699},{},[700],{"type":24,"value":701},"Com um número suficiente de nós ao redor do mundo, não apenas enviaremos uma mensagem forte contra a privatização do conhecimento - faremos disso algo do passado. Você vai se juntar a nós?",{"type":19,"tag":63,"props":703,"children":704},{},[],{"type":19,"tag":20,"props":706,"children":707},{},[708],{"type":24,"value":103},{"type":19,"tag":20,"props":710,"children":711},{},[712],{"type":24,"value":713},"Julho de 2008, Eremo, Itália",{"type":19,"tag":63,"props":715,"children":716},{},[],{"type":19,"tag":63,"props":718,"children":719},{},[],{"type":19,"tag":26,"props":721,"children":723},{"id":722},"guerilla-open-access-manifesto-1",[724],{"type":24,"value":31},{"type":19,"tag":20,"props":726,"children":727},{},[728],{"type":24,"value":729},"Information ist Macht. Doch wie bei jeder Macht gibt es diejenigen, die sie für sich behalten möchten. Das gesamte wissenschaftliche und kulturelle Erbe der Welt, das über Jahrhunderte in Büchern und Zeitschriften veröffentlicht wurde, wird zunehmend digitalisiert und von einer Handvoll privater Unternehmen gesperrt. Möchtest du die Artikel mit den berühmtesten Ergebnissen der Wissenschaften lesen? Du müsstest enorme Beträge an Verlage wie Reed Elsevier zahlen.",{"type":19,"tag":20,"props":731,"children":732},{},[733],{"type":24,"value":734},"Es gibt Menschen, die darum kämpfen, dies zu ändern. Die Open-Access-Bewegung hat tapfer gekämpft, um sicherzustellen, dass Wissenschaftler ihre Urheberrechte nicht aufgeben, sondern ihre Arbeit im Internet unter Bedingungen veröffentlichen können, die es jedem ermöglichen, darauf zuzugreifen. Doch selbst unter den besten Bedingungen wird sich ihre Arbeit nur auf zukünftige Veröffentlichungen beziehen.",{"type":19,"tag":20,"props":736,"children":737},{},[738],{"type":24,"value":739},"Alles bis jetzt wird verloren gegangen sein.",{"type":19,"tag":20,"props":741,"children":742},{},[743],{"type":24,"value":744},"Das ist ein viel zu hoher Preis. Akademiker dazu zu zwingen, Geld zu zahlen, um die Arbeiten ihrer Kollegen zu lesen? Ganze Bibliotheken zu scannen, aber nur den Leuten bei Google den Zugriff darauf zu erlauben? Wissenschaftliche Artikel denjenigen in Eliteuniversitäten der Ersten Welt zur Verfügung zu stellen, aber nicht den Kindern im Globalen Süden? Das ist empörend und inakzeptabel.",{"type":19,"tag":20,"props":746,"children":747},{},[748],{"type":24,"value":749},"\"Ja, ich stimme zu\", sagen viele, \"aber was können wir tun? Die Unternehmen halten die Urheberrechte, sie verdienen enorme Summen, indem sie für den Zugang Geld verlangen, und es ist völlig legal - wir können nichts tun, um sie zu stoppen.\" Aber es gibt etwas, das wir tun können, etwas, das bereits geschieht: Wir können zurückschlagen.",{"type":19,"tag":20,"props":751,"children":752},{},[753],{"type":24,"value":754},"Diejenigen, die Zugang zu diesen Ressourcen haben - Studenten, Bibliothekare, Wissenschaftler -, haben ein Privileg erhalten. Ihr könnt von diesem Bankett des Wissens profitieren, während der Rest der Welt ausgesperrt ist. Aber ihr müsst dieses Privileg nicht - ja, moralisch gesehen könnt ihr es nicht - nur für euch behalten. Ihr habt die Pflicht, es mit der Welt zu teilen. Und das habt ihr auch getan: Ihr tauscht Passwörter mit Kollegen aus, erfüllt Download-Anfragen von Freunden.",{"type":19,"tag":63,"props":756,"children":757},{},[],{"type":19,"tag":20,"props":759,"children":760},{},[761],{"type":24,"value":762},"In der Zwischenzeit bleiben diejenigen, die ausgesperrt sind, nicht untätig. Ihr schleicht euch durch Lücken und über Zäune, befreit die von den Verlagen gesperrten Informationen und teilt sie mit euren Freunden.",{"type":19,"tag":20,"props":764,"children":765},{},[766],{"type":24,"value":767},"Doch all dieses Handeln geschieht im Verborgenen, im verborgenen Untergrund. Es wird Diebstahl oder Piraterie genannt, als ob das Teilen eines Reichtums an Wissen dem moralischen Äquivalent von der Plünderung eines Schiffs und dem Mord an seiner Besatzung entspräche. Aber Teilen ist nicht unmoralisch - es ist ein moralisches Gebot. Nur diejenigen, die von Gier geblendet sind, würden es ablehnen, einem Freund eine Kopie zu ermöglichen.",{"type":19,"tag":20,"props":769,"children":770},{},[771],{"type":24,"value":772},"Große Unternehmen sind natürlich von Gier geblendet. Die Gesetze, unter denen sie arbeiten, erfordern es - ihre Aktionäre würden sich bei weniger empören. Und die Politiker, die sie bestochen haben, unterstützen sie, indem sie Gesetze verabschieden, die ihnen die exklusive Macht geben, zu entscheiden, wer Kopien machen darf.",{"type":19,"tag":20,"props":774,"children":775},{},[776],{"type":24,"value":777},"Es gibt keine Gerechtigkeit darin, ungerechten Gesetzen zu folgen. Es ist an der Zeit, ins Licht zu treten und in der großen Tradition des zivilen Ungehorsams unseren Widerstand gegen diesen privaten Diebstahl der öffentlichen Kultur zu erklären.",{"type":19,"tag":20,"props":779,"children":780},{},[781],{"type":24,"value":782},"Wir müssen Informationen, egal wo sie gespeichert sind, kopieren und sie mit der Welt teilen. Wir müssen Dinge, die nicht urheberrechtlich geschützt sind, in das Archiv aufnehmen. Wir müssen geheime Datenbanken kaufen und sie ins Internet stellen. Wir müssen wissenschaftliche Zeitschriften herunterladen und in Filesharing-Netzwerken hochladen. Wir müssen für den Guerilla Open Access kämpfen.",{"type":19,"tag":20,"props":784,"children":785},{},[786],{"type":24,"value":787},"Mit genügend Menschen weltweit werden wir nicht nur eine starke Botschaft gegen die Privatisierung des Wissens senden - wir werden es zur Vergangenheit machen. Wirst du dich uns anschließen?",{"type":19,"tag":63,"props":789,"children":790},{},[],{"type":19,"tag":20,"props":792,"children":793},{},[794],{"type":24,"value":103},{"type":19,"tag":20,"props":796,"children":797},{},[798],{"type":24,"value":799},"Juli 2008, Eremo, Italien",{"type":19,"tag":63,"props":801,"children":802},{},[],{"type":19,"tag":63,"props":804,"children":805},{},[],{"type":19,"tag":26,"props":807,"children":809},{"id":808},"게릴라-오픈-액세스-선언문",[810],{"type":24,"value":811},"게릴라 오픈 액세스 선언문",{"type":19,"tag":20,"props":813,"children":814},{},[815],{"type":24,"value":816},"정보는 힘입니다. 그러나 모든 힘과 마찬가지로 그것을 자신들만이 간직하려는 사람들이 있습니다. 세기 동안 책과 학술지에 출판된 전 세계의 과학적, 문화적 유산은 몇 개의 민간 기업에 의해 점점 디지털화되고 잠겨있게 되었습니다. 과학의 가장 유명한 결과가 포함된 논문을 읽고 싶습니까? Reed Elsevier와 같은 출판사에 상당한 금액을 송금해야합니다.",{"type":19,"tag":20,"props":818,"children":819},{},[820],{"type":24,"value":821},"이를 변경하려고 애쓰는 사람들이 있습니다. 오픈 액세스 운동은 과학자들이 저작권을 포기하는 대신 자신들의 작업이 인터넷에 공개되어 누구나 접근할 수 있는 조건으로 게시되도록 노력해왔습니다. 그러나 최상의 경우에도 그들의 작업은 앞으로 게시되는 것에만 적용될 것입니다.",{"type":19,"tag":20,"props":823,"children":824},{},[825],{"type":24,"value":826},"지금까지의 모든 것은 소실될 것입니다.",{"type":19,"tag":20,"props":828,"children":829},{},[830],{"type":24,"value":831},"그것은 지나치게 높은 대가입니다. 학문가들이 동료들의 작업을 읽기 위해 돈을 지불하도록 강요하는 것인가요? 도서관 전체를 스캔하지만 Google의 사람들만이 읽을 수 있도록 하는 것인가요? 고위대학에 있는 사람들에게 과학적 논문을 제공하지만 글로벌 남쪽의 어린이들에게는 제공하지 않는 것인가요? 이것은 불합리하고 받아들일 수 없는 일입니다.",{"type":19,"tag":20,"props":833,"children":834},{},[835],{"type":24,"value":836},"\"네, 동의합니다.\" 많은 사람들이 말합니다. \"하지만 우리는 어떻게 할 수 있을까요? 회사들이 저작권을 소유하고 접근에 대한 수익을 많이 올리고, 그것이 완벽하게 합법적인 일이기 때문에 우리는 그들을 멈출 방법이 없습니다.\" 하지만 우리가 할 수 있는 것이 있습니다. 이미 진행 중인 일이 있습니다. 우리는 반격할 수 있습니다.",{"type":19,"tag":20,"props":838,"children":839},{},[840],{"type":24,"value":841},"이러한 자원에 액세스 할 수 있는 사람들 - 학생, 도서관장, 과학자 - 여러분은 특권을 받았습니다. 전세계가 차단된 상태에서 여러분은 이 지식의 연회에서 식사를 할 수 있습니다. 그러나 여러분은 필요하지 않습니다 - 실제로 도덕적으로도 여러분은 자신들만을 위해 이 특권을 지킬 수 없습니다. 여러분은 이를 세상과 공유해야 합니다. 그리고 여러분은 이미 그렇게 하고 있습니다: 동료들과 암호를 교환하고, 친구들에게 다운로드 요청을 충족시킵니다.",{"type":19,"tag":63,"props":843,"children":844},{},[],{"type":19,"tag":20,"props":846,"children":847},{},[848],{"type":24,"value":849},"한편, 차단된 사람들은 가만히 서 있지 않습니다. 여러분은 구멍을 통해 슬쩍 들어가고 울타리를 넘어가며 출판사가 잠긴 정보를 해방하고 친구들과 공유하고 있습니다.",{"type":19,"tag":20,"props":851,"children":852},{},[853],{"type":24,"value":854},"하지만 이 모든 행동은 어둠 가운데서 진행됩니다. 그것은 도난이나 해적 행위로 불리는데, 마치 지식의 보물을 약탈하고 그 선원들을 살해하는 것과 동등한 도덕적인 행위인 것처럼 말입니다. 그러나 공유는 비도덕적인 것이 아니라 도덕적인 의무입니다. 욕심에 눈이 멀어진 사람들만이 친구가 사본을 만드는 것을 거부할 것입니다.",{"type":19,"tag":20,"props":856,"children":857},{},[858],{"type":24,"value":859},"대기업들은 물론 욕심에 눈이 멀었습니다. 그들이 운영하는 법률들은 그렇게 요구합니다 - 그들의 주주들은 더 적은 것에 대해 반란을 일으킬 것입니다. 그리고 그들에게 사취당한 정치인들은 그들을 지지하며, 복사본을 만들 수 있는 독점적인 권력을 주는 법률을 통과시킵니다.",{"type":19,"tag":20,"props":861,"children":862},{},[863],{"type":24,"value":864},"불공정한 법률을 따르는 것에는 정의가 없습니다. 이제 빛으로 들어와서 시민적 불복종의 위대한 전통 속에서 이 사적인 공공문화의 도난에 대한 저희 반대를 선언할 때입니다.",{"type":19,"tag":20,"props":866,"children":867},{},[868],{"type":24,"value":869},"저장된 위치에 상관없이 정보를 가져와서 사본을 만들고 세계와 공유해야 합니다. 저작권이 만료된 것을 가져와서 아카이브에 추가해야 합니다. 비밀 데이터베이스를 구입하고 웹에 올려야 합니다. 과학 논문을 다운로드하고 파일 공유 네트워크에 업로드해야 합니다. 게릴라 오픈 액세스를 위해 싸워야 합니다.",{"type":19,"tag":20,"props":871,"children":872},{},[873],{"type":24,"value":874},"전 세계에 충분한 수의 우리가 있다면, 지식의 사유화에 대항하는 강력한 메시지를 보내는 것뿐만 아니라, 그것을 과거의 것으로 만들 것입니다. 함께 해 주시겠습니까?",{"type":19,"tag":63,"props":876,"children":877},{},[],{"type":19,"tag":20,"props":879,"children":880},{},[881],{"type":24,"value":882},"아론 스워츠",{"type":19,"tag":20,"props":884,"children":885},{},[886],{"type":24,"value":887},"2008년 7월, 에레모, 이탈리아",{"type":19,"tag":63,"props":889,"children":890},{},[],{"title":7,"searchDepth":892,"depth":892,"links":893},2,[],"markdown","content:blog:guerillaopenaccessmanifesto.md","content","blog/guerillaopenaccessmanifesto.md","blog/guerillaopenaccessmanifesto","md",1740806552537]