[{"data":1,"prerenderedAt":1310},["ShallowReactive",2],{"content-query-ENkAq0QWjY":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"categories":11,"tags":13,"body":17,"_type":1304,"_id":1305,"_source":1306,"_file":1307,"_stem":1308,"_extension":1309},"/blog/journey-of-the-dream-weaver","blog",false,"","Journey of the Dream Weaver","In every geek's heart lies a dream of decentralization. This is a story about Dominic Williams.","2023-03-10",[12],"Ponder on the world",[14,15,16],"English","BlockChain","IC",{"type":18,"children":19,"toc":1294},"root",[20,27,31,38,43,48,53,56,61,64,69,74,77,82,87,93,98,103,106,111,116,121,124,129,134,139,142,147,153,156,161,166,171,174,179,185,188,193,198,201,206,211,216,219,224,229,234,240,245,250,253,259,264,280,285,290,295,301,315,320,323,328,333,338,344,347,352,355,360,364,367,372,377,382,388,393,396,401,407,410,415,420,425,430,433,438,441,447,452,457,460,473,479,498,517,523,528,533,536,541,546,549,554,572,578,583,587,590,595,600,604,609,614,618,623,626,631,636,641,644,649,655,660,665,668,673,676,682,687,690,695,701,706,711,716,719,724,729,734,739,743,746,751,756,761,764,769,774,779,782,787,790,795,800,805,810,835,838,843,848,853,856,861,866,871,879,884,889,892,897,907,910,915,920,923,928,933,938,941,946,951,955,960,963,968,972,975,978,983,986,991,994,999,1002,1007,1012,1017,1022,1025,1030,1033,1038,1042,1045,1050,1054,1057,1062,1067,1070,1075,1080,1085,1088,1093,1098,1101,1115,1119,1122,1127,1131,1134,1139,1144,1149,1153,1158,1164,1167,1171,1174,1179,1184,1189,1192,1195,1200,1205,1210,1213,1216,1219,1222,1225,1232,1237,1242,1247,1252,1257,1262,1267,1270,1275,1280,1285,1288,1291],{"type":21,"tag":22,"props":23,"children":24},"element","p",{},[25],{"type":26,"value":9},"text",{"type":21,"tag":28,"props":29,"children":30},"br",{},[],{"type":21,"tag":32,"props":33,"children":35},"h2",{"id":34},"jahebil",[36],{"type":26,"value":37},"JAHEBIL",{"type":21,"tag":22,"props":39,"children":40},{},[41],{"type":26,"value":42},"He liked to call himself \"JAHEBIL\", which stands for \"Just Another Hacker Entrepreneur Based in London\".",{"type":21,"tag":22,"props":44,"children":45},{},[46],{"type":26,"value":47},"He wrote code, started businesses, and worked as a \"dream maker\" in London.",{"type":21,"tag":22,"props":49,"children":50},{},[51],{"type":26,"value":52},"He was brave and optimistic, living a secluded life, not interested in socializing, and only concerned about the brand of his company, living a repetitive and focused life. Even working 18-hour days in an unfriendly entrepreneurial environment in the UK, he could still hum the happiest tunes.",{"type":21,"tag":28,"props":54,"children":55},{},[],{"type":21,"tag":22,"props":57,"children":58},{},[59],{"type":26,"value":60},"Compared to Silicon Valley, the UK's entrepreneurial environment was like a living hell. The success of numerous companies in Silicon Valley led to even greater investments, which attracted top entrepreneurs from around the world to the area, either to reach the pinnacle of success or fail. Unlike Silicon Valley's talented pool, in the UK, every company that Dominic founded could only produce limited returns, then he would start another company, getting caught in a vicious cycle of working hard, making dreams, maintaining dreams, and making new dreams... He had to sharpen his skills to improve technically while ensuring the company remained profitable.",{"type":21,"tag":28,"props":62,"children":63},{},[],{"type":21,"tag":22,"props":65,"children":66},{},[67],{"type":26,"value":68},"Tired of the cyclical life that was only draining his enthusiasm, the seed of hope ground at Dominic's heart. In 2010, as a dream maker, he decided to take a big risk!",{"type":21,"tag":22,"props":70,"children":71},{},[72],{"type":26,"value":73},"Fight My Monster was a massively multiplayer online game and a children's social network. He planned to connect children from all over the world to play this game online. Players have their own monsters and use different skills to attack each other in a turn-based battle. At that time, on the other side of the earth, China was also going crazy for \"Roco Kingdom\" developed by Tencent.",{"type":21,"tag":28,"props":75,"children":76},{},[],{"type":21,"tag":22,"props":78,"children":79},{},[80],{"type":26,"value":81},"After comparing HBase, Cassandra, and other databases, Dominic chose the early Cassandra beta, the first horizontally scalable distributed database. Dominic built various tools for Cassandra, including the first system that ran atomic transactions on scalable eventually consistent storage. They were the first team in the world to attempt to use a complex Cassandra system in a production environment.",{"type":21,"tag":22,"props":83,"children":84},{},[85],{"type":26,"value":86},"Dominic wanted to connect millions of users worldwide through a distributed system, which was a significant innovation at the time. After several test runs, the game was officially launched on New Year's Day in 2011, and in just two weeks, it gained 30,000 users, skyrocketing to 300,000 users in just a few months.",{"type":21,"tag":88,"props":89,"children":92},"img",{"src":90,"style":91},"https://s1.imagehub.cc/images/2023/01/28/d2419844809577766fb86cff3e8ae005.jpeg","zoom:35%;",[],{"type":21,"tag":22,"props":94,"children":95},{},[96],{"type":26,"value":97},"The team achieved remarkable success in scaling up their business despite having a meager budget. However, they had overlooked one crucial factor - the development of a large-scale online game required an army of specialists, including Flash developers, database administrators, network engineers, payment system experts, operations and maintenance personnel, complexity analysts, cartoon artists, sound engineers, music composers, animation experts, advertising gurus, and more.",{"type":21,"tag":22,"props":99,"children":100},{},[101],{"type":26,"value":102},"This massive expenditure surpassed any budget they had previously allocated to their entrepreneurial projects. In due course, Dominic and his friends exhausted their investment and were forced to seek additional funding. Day and night's overnight work resulted in an almost perfect growth chart, \"so raising funds shouldn't be too difficult\".",{"type":21,"tag":28,"props":104,"children":105},{},[],{"type":21,"tag":22,"props":107,"children":108},{},[109],{"type":26,"value":110},"Dominic introduced the project to investors, saying, \"Fight My Monster is growing rapidly and will soon exceed one million users. We believe that engineers live in an exciting era, and the Internet infrastructure is already mature. Many things can suddenly be achieved in new ways. This company was initially self-sufficient on a very limited budget. You may have heard that Fight My Monster is expanding, and now many excellent engineers have the opportunity to join us\".",{"type":21,"tag":22,"props":112,"children":113},{},[114],{"type":26,"value":115},"\"Let me explain our architecture plan and why we did it this way. As you can see, it is not a traditional architecture. We chose a simple but scalable three-tier architecture, which we host in the cloud. I hope this system works...\" Dominic continued passionately.",{"type":21,"tag":22,"props":117,"children":118},{},[119],{"type":26,"value":120},"\"Since you already have so many users, maybe you should try to get more of them to pay. This will not only prove your ability to make money but also get our investment.\" The other party frowned, clearly reluctant to invest. Faced with such a crazy user growth, London investors even suspected Dominic of fabricating data.",{"type":21,"tag":28,"props":122,"children":123},{},[],{"type":21,"tag":22,"props":125,"children":126},{},[127],{"type":26,"value":128},"Now, Dominic's heart was shattered like a biscuit. He had underestimated the difficulty of financing.",{"type":21,"tag":22,"props":130,"children":131},{},[132],{"type":26,"value":133},"Soon, the pieces turned to crumbs. At this point, competitors had already secured funding from other investment firms and prevented other investment firms from investing in Fight My Monster.",{"type":21,"tag":22,"props":135,"children":136},{},[137],{"type":26,"value":138},"Was it because they weren't working hard enough?",{"type":21,"tag":28,"props":140,"children":141},{},[],{"type":21,"tag":22,"props":143,"children":144},{},[145],{"type":26,"value":146},"Because Cassandra was also in early development, at the end of 2011, due to bugs in Cassandra beta code, Fight My Monster's user data was almost lost. It took several days and nights of work from Cassandra senior engineers and Dominic's team to save the data, ultimately resolving this horrific incident.",{"type":21,"tag":88,"props":148,"children":152},{"src":149,"alt":150,"style":151},"https://s1.imagehub.cc/images/2023/01/26/e2727ae940125d7ce368730cda151745.png","image-20230124210608095","zoom:33%;",[],{"type":21,"tag":28,"props":154,"children":155},{},[],{"type":21,"tag":22,"props":157,"children":158},{},[159],{"type":26,"value":160},"Dominic was in a constant flurry of activity.",{"type":21,"tag":22,"props":162,"children":163},{},[164],{"type":26,"value":165},"He raced between his home and the company like a wound-up toy car: just after fixing a bug, he was off to meet with investors without even testing it first; he barely had time to eat, his head buried in meetings with engineers to discuss system adjustments; as soon as he left the company, he was off to the supermarket to buy Christmas gifts for his wife...",{"type":21,"tag":22,"props":167,"children":168},{},[169],{"type":26,"value":170},"The team relied heavily on him, and his workload became overwhelmingly heavy - a rare sight even in the startup capital of Silicon Valley. Dominic worked 12 to 18 hours every day, a work pattern that is almost unheard of in today's startup world. He juggled business management, system administration, and coding, all while trying to maintain a personal life. In no time, his wife became accustomed to this lifestyle: during the day, she directed and planned games, perfecting game play and project processes, and at night, she cooked and cleaned the house, all in seamless cooperation with Dominic.",{"type":21,"tag":28,"props":172,"children":173},{},[],{"type":21,"tag":22,"props":175,"children":176},{},[177],{"type":26,"value":178},"Dominic's photos.",{"type":21,"tag":88,"props":180,"children":184},{"src":181,"alt":182,"style":183},"https://s1.imagehub.cc/images/2023/01/26/d5fa82e6a76e2272bcdad16a8cf7692c.jpeg","Image","zoom:32%;",[],{"type":21,"tag":28,"props":186,"children":187},{},[],{"type":21,"tag":22,"props":189,"children":190},{},[191],{"type":26,"value":192},"Dominic became even more hardworking after that. Fortunately, he happened to meet a company willing to invest in him in Silicon Valley. Finally, an investor was moved by this dreamer in front of them. Within a few weeks of raising funds, Fight My Monster's user count quickly reached 1 million. A few months later, Dominic relocated the company to San Mateo (a small town near San Francisco).",{"type":21,"tag":22,"props":194,"children":195},{},[196],{"type":26,"value":197},"He went downstairs to have coffee and when he came back, his memo was filled with common problems and solutions for ConcurrentHashMap, he listened to geeks talking about how to build a team for a startup, and he made connections with venture capitalists in Silicon Valley.",{"type":21,"tag":28,"props":199,"children":200},{},[],{"type":21,"tag":22,"props":202,"children":203},{},[204],{"type":26,"value":205},"After a year of development, Dominic was very excited in 2012:",{"type":21,"tag":22,"props":207,"children":208},{},[209],{"type":26,"value":210},"\"Fight My Monster appeared on TechCrunch today, worth a big cheer, thank you!!! We are working hard and hope we can achieve our dreams.\"",{"type":21,"tag":22,"props":212,"children":213},{},[214],{"type":26,"value":215},"\"If you haven't played Fight My Monster yet, I suggest you give it a try - there really is nothing better online. We are incubating in the UK, and the best time to experience the site is weekdays (after school) from 4 pm to 8 pm or weekends during the day.\"",{"type":21,"tag":28,"props":217,"children":218},{},[],{"type":21,"tag":22,"props":220,"children":221},{},[222],{"type":26,"value":223},"However, setbacks soon followed. After raising funds, the company's newly hired financial executive disagreed with the original team on strategy, and the disagreement escalated into a fatal decision-making mistake. Although the user base continued to grow, Fight My Monster was facing insurmountable obstacles.",{"type":21,"tag":22,"props":225,"children":226},{},[227],{"type":26,"value":228},"From a financial return perspective, Fight My Monster was a failure, with the user base only expanding to over 3 million in 2013.",{"type":21,"tag":22,"props":230,"children":231},{},[232],{"type":26,"value":233},"However, this experience was very valuable, and the most precious part was finding a group of capable colleagues who were also obsessed with the distributed system that Dominic loved. Dominic admired Fight My Monster's designer Jon Ball, who was always able to create a bunch of beautiful models using the team's design system, and later set the record for the highest ad viewing rate. There was also Aaron Morton, the Cassandra engineer who said \"We work together, believe each other\", who worked with Dominic to build the \"engine\" behind the game - a distributed database.",{"type":21,"tag":88,"props":235,"children":239},{"src":236,"alt":237,"style":238},"https://s1.imagehub.cc/images/2023/01/26/c509771324246de22e736b76c24b2343.png","image-20230124164720298","zoom:37%;",[],{"type":21,"tag":22,"props":241,"children":242},{},[243],{"type":26,"value":244},"In hindsight, Dominic's Flash game was no longer popular as people were gradually shifting towards mobile games and tablets. In 2010, Steve Jobs announced that Apple would no longer support Flash on its devices due to its impact on device performance. Additionally, due to frequent security vulnerabilities, BBC published an article titled \"How much longer can Flash survive?\" Shortly after, Adobe announced that it was abandoning the Flash project and switching to Animate for professional animation.",{"type":21,"tag":22,"props":246,"children":247},{},[248],{"type":26,"value":249},"Reflecting on his experience, Dominic said, \"We could have succeeded but needed to move faster: if I had my time again, I would have relocated to The Valley very soon after the company started growing to raise money faster and gain access to a bigger pool of experienced gaming executives\".",{"type":21,"tag":28,"props":251,"children":252},{},[],{"type":21,"tag":32,"props":254,"children":256},{"id":255},"tracing-back-to-the-early-years",[257],{"type":26,"value":258},"Tracing Back to the Early Years",{"type":21,"tag":22,"props":260,"children":261},{},[262],{"type":26,"value":263},"Although the gaming industry was withering away, in Silicon Valley, a strange yet formidable force captured Dominic's attention, causing ripples to emerge in his mind's stagnant pool of inspiration. These ripples quickly transformed into rolling waves, propelling him towards a new frontier.",{"type":21,"tag":22,"props":265,"children":266},{},[267,269,278],{"type":26,"value":268},"Rewinding back to 1998, Dominic was developing an online storage system for a London-based startup and utilizing Wei Dai's ",{"type":21,"tag":270,"props":271,"children":275},"a",{"href":272,"rel":273},"http://www.weidai.com",[274],"nofollow",[276],{"type":26,"value":277},"Crypto++",{"type":26,"value":279}," library extensively. While browsing Wei Dai's website, Dominic stumbled upon an article about \"b-money\", one of the early precursors to Bitcoin.",{"type":21,"tag":22,"props":281,"children":282},{},[283],{"type":26,"value":284},"Little did Dominic know that this article from 1998 would ignite the spark for Bitcoin and connect the timeline of his cryptography career for the next decade.",{"type":21,"tag":88,"props":286,"children":289},{"src":287,"alt":272,"style":288},"https://s1.imagehub.cc/images/2023/01/26/9d3e99b7d9b265f272df6f184b1d467f.png","zoom: 50%;",[],{"type":21,"tag":22,"props":291,"children":292},{},[293],{"type":26,"value":294},"After leaving Fight My Monster in 2013, Dominic became obsessed with Bitcoin, a long-dormant interest that had been sparked by the \"b-money\" article he had stumbled upon back in 1998.",{"type":21,"tag":88,"props":296,"children":300},{"src":297,"alt":298,"style":299},"https://s1.imagehub.cc/images/2023/01/26/0c0ef2986203947e6d9d9bd7fb29bba4.png","image-20230124132844405","zoom:67%;",[],{"type":21,"tag":22,"props":302,"children":303},{},[304,306,313],{"type":26,"value":305},"Wei Dai wrote in ",{"type":21,"tag":270,"props":307,"children":310},{"href":308,"rel":309},"http://www.weidai.com/bmoney.txt",[274],[311],{"type":26,"value":312},"b-money",{"type":26,"value":314},":",{"type":21,"tag":22,"props":316,"children":317},{},[318],{"type":26,"value":319},"\"I am fascinated by Tim May's crypto-anarchy. Unlike the typical understanding of 'anarchy', in a crypto-anarchy the government is not temporarily destroyed but permanently forbidden and unnecessary. It's a community where the threat of violence is impotent because violence is impossible, and violence is impossible because its participants cannot be linked to their true names or physical locations through cryptography\".",{"type":21,"tag":28,"props":321,"children":322},{},[],{"type":21,"tag":22,"props":324,"children":325},{},[326],{"type":26,"value":327},"B-money outlined a protocol for providing currency exchange and contract execution services in an anonymous community. Wei Dai first introduced a less practical protocol as a prelude because it required a synchronous, interference-free anonymous broadcast channel. He then proposed a practical protocol. In all schemes, Wei Dai assumed the existence of an untraceable network where senders and receivers could only be identified by digital pseudonyms (i.e., public keys), and each message was signed by the sender and encrypted for the receiver.",{"type":21,"tag":22,"props":329,"children":330},{},[331],{"type":26,"value":332},"Wei Dai described in detail how to create currency, how to send it, how to prevent double-spending, how to broadcast transaction information, and how to achieve consensus among servers.",{"type":21,"tag":22,"props":334,"children":335},{},[336],{"type":26,"value":337},"We cannot determine the relationship between Wei Dai's b-money and Bitcoin or whether he was inspired by \"The Sovereign Individual\" to design a scheme. However, Wei Dai's website shows that it was last updated on January 10, 2021.",{"type":21,"tag":88,"props":339,"children":343},{"src":340,"alt":341,"style":342},"https://s1.imagehub.cc/images/2023/01/26/cc24110e86f36b5623b94b5bff3b1f9f.png","image-20230124140739990","zoom:80%;",[],{"type":21,"tag":28,"props":345,"children":346},{},[],{"type":21,"tag":22,"props":348,"children":349},{},[350],{"type":26,"value":351},"Dominic said, \"I love algorithms and distributed computing, and I won many awards in this field during university. More importantly, I had never encountered a technical field that combined the thinking of finance, law, politics, economics, and philosophy, while also having the potential to drive significant change in the world. For me, this emerging field was a dream come true. I made a bigger life decision to re-enter this field with my career\".",{"type":21,"tag":28,"props":353,"children":354},{},[],{"type":21,"tag":22,"props":356,"children":357},{},[358],{"type":26,"value":359},"Here is Dominic's \"Bitcoin ATM kiss\" in 2014.",{"type":21,"tag":88,"props":361,"children":363},{"src":362,"style":151},"https://s1.imagehub.cc/images/2023/01/26/83403aa2179a2e9ded1d8f5bc9dc71e2.png",[],{"type":21,"tag":28,"props":365,"children":366},{},[],{"type":21,"tag":22,"props":368,"children":369},{},[370],{"type":26,"value":371},"In 2014, while trading cryptocurrencies, Dominic immersed himself in learning the fundamentals of consensus algorithms.",{"type":21,"tag":22,"props":373,"children":374},{},[375],{"type":26,"value":376},"On February 7th, Mt. Gox, the world's largest Bitcoin exchange, announced its bankruptcy. Dominic took to Twitter to express his distress at the beloved Bitcoin's plummeting value.",{"type":21,"tag":22,"props":378,"children":379},{},[380],{"type":26,"value":381},"Bitcoin crashed to 666 USD. (It's currently priced at 23,000 USD, down from its peak of 69,000 USD.)",{"type":21,"tag":88,"props":383,"children":387},{"src":384,"alt":385,"style":386},"https://s1.imagehub.cc/images/2023/01/26/77ae5916be556e50b88f07b00bf1343f.png","image-20230123222354219","zoom:50%;",[],{"type":21,"tag":22,"props":389,"children":390},{},[391],{"type":26,"value":392},"Dominic immersed himself in the research of traditional Byzantine fault tolerance and combined it with his previous experience. He came up with a decentralized network that can scale horizontally like Cassandra - allowing more and more servers to join and maintain high performance. Within a few days, Dominic published a paper describing a scalable cryptocurrency called Pebble. The paper quietly circulated within a small circle of cryptography enthusiasts, and it was the first system to describe a decentralized sharding approach. In this system, each shard uses an asynchronous Byzantine fault tolerance algorithm to achieve consensus.",{"type":21,"tag":28,"props":394,"children":395},{},[],{"type":21,"tag":22,"props":397,"children":398},{},[399],{"type":26,"value":400},"While learning, Dominic didn't forget to trade Bitcoin. Investing in Bitcoin brought him some peace of mind, and now he could focus on designing consensus algorithms without having to work day and night or in a frenzy.",{"type":21,"tag":88,"props":402,"children":406},{"src":403,"alt":404,"style":405},"https://s1.imagehub.cc/images/2023/01/26/60f45fe06eb9fa990443162691e7cab8.png","image-20230123222606352","zoom:52%;",[],{"type":21,"tag":28,"props":408,"children":409},{},[],{"type":21,"tag":22,"props":411,"children":412},{},[413],{"type":26,"value":414},"Dominic's research focuses on protocols and cryptography, which are like dry kindling that reignites the dreamer's inner spark. Dominic believes that these protocols and cryptographic algorithms can change the world. He took the \"D\" for decentralized and the \"finity\" for infinity and combined them to create \"Dfinity\". Dfinity aims to create a decentralized application platform with infinite scalability.",{"type":21,"tag":22,"props":416,"children":417},{},[418],{"type":26,"value":419},"After returning to Mountain View, California from China, Dominic tweeted, \"China Loves Blockchain :)\".",{"type":21,"tag":88,"props":421,"children":424},{"src":422,"alt":423,"style":299},"https://s1.imagehub.cc/images/2023/01/26/12d2ad4630ef26d1c5988adf7a901d51.png","image-20230123222921586",[],{"type":21,"tag":22,"props":426,"children":427},{},[428],{"type":26,"value":429},"Like Ethereum, Dominic also received investment in China. The reason is simple. Silicon Valley invested in Bitcoin very early and gained huge returns, so they don't care much about \"altcoins\" (the secular view is that coins other than Bitcoin are \"altcoins\", which are basically coins that are slightly improved versions of Bitcoin).",{"type":21,"tag":28,"props":431,"children":432},{},[],{"type":21,"tag":22,"props":434,"children":435},{},[436],{"type":26,"value":437},"Next, I need to introduce what the Dfinity team is doing in detail.",{"type":21,"tag":28,"props":439,"children":440},{},[],{"type":21,"tag":32,"props":442,"children":444},{"id":443},"point-line-surface-solid",[445],{"type":26,"value":446},"Point. Line. Surface. Solid!",{"type":21,"tag":22,"props":448,"children":449},{},[450],{"type":26,"value":451},"We know that Bitcoin is the pioneer of blockchain. Bitcoin itself emerged slowly in the long-term pursuit of decentralized currency projects by cypherpunks.",{"type":21,"tag":22,"props":453,"children":454},{},[455],{"type":26,"value":456},"It created an open ledger system: people from all over the world can join or leave at any time, rely on consensus algorithms to keep everyone's data consistent, and create a co-creation, co-construction, and shared decentralized network. People just need to download the Bitcoin software (downloading the source code and compiling it is also possible), and then start running it on their own machines to join the Bitcoin network. Bitcoin will enable computers around the world to reach a consensus and jointly record every transaction. With everyone's record, the legendary feature of \"immutability\" in blockchain is achieved, which is actually a matter of majority rule and not being able to cheat everyone.",{"type":21,"tag":28,"props":458,"children":459},{},[],{"type":21,"tag":22,"props":461,"children":462},{},[463,465,471],{"type":26,"value":464},"In the traditional network architecture, user data is indiscriminately stuffed into servers. Users cannot truly control their own data, and whoever controls the server has the final say. If we can view this one-to-many relationship as \"",{"type":21,"tag":466,"props":467,"children":468},"strong",{},[469],{"type":26,"value":470},"points",{"type":26,"value":472},"\" scattered around the world, the user's data flows into each point tirelessly.",{"type":21,"tag":88,"props":474,"children":478},{"src":475,"alt":476,"style":477},"https://s1.imagehub.cc/images/2023/03/12/114ae224b59654899e49f3e6da932b50.png","image-20230124222808798","zoom:25%;",[],{"type":21,"tag":22,"props":480,"children":481},{},[482,484,489,491,496],{"type":26,"value":483},"So the Bitcoin network can be seen as a \"",{"type":21,"tag":466,"props":485,"children":486},{},[487],{"type":26,"value":488},"line",{"type":26,"value":490},"\", it connects isolated points into a line, making the internet more fair and open. What Bitcoin does is to combine computers from all over the world to form a huge \"",{"type":21,"tag":466,"props":492,"children":493},{},[494],{"type":26,"value":495},"world ledger",{"type":26,"value":497},"\". So what if you want to record something else? Just imitate Bitcoin and create a new one!",{"type":21,"tag":22,"props":499,"children":500},{},[501,503,508,510,515],{"type":26,"value":502},"Six years after the birth of Bitcoin, a \"",{"type":21,"tag":466,"props":504,"children":505},{},[506],{"type":26,"value":507},"surface",{"type":26,"value":509},"\" that can deploy software on a decentralized network gradually emerged, called Ethereum. Ethereum is not a replica of Bitcoin's world ledger. Ethereum has created a shared and universal virtual \"",{"type":21,"tag":466,"props":511,"children":512},{},[513],{"type":26,"value":514},"world computer",{"type":26,"value":516},"\", with Ethereum's virtual machine running on everyone's computer. Like the Bitcoin ledger, it is tamper-proof and cannot be modified. Everyone can write software and deploy it on the virtual machine, as long as they pay a bit of ether to the miners. (There are no miners anymore, but that's another article 😋)",{"type":21,"tag":88,"props":518,"children":522},{"src":519,"alt":520,"style":521},"https://s1.imagehub.cc/images/2023/01/26/38d3219e513911f18db5c8468841e030.png","image-20230124190858096","zoom:27%;",[],{"type":21,"tag":22,"props":524,"children":525},{},[526],{"type":26,"value":527},"Deployed software on the blockchain becomes an automated vending machine, permanently stored within a distributed and decentralized network that fairly and justly evaluates each transaction to determine if conditions are met. With the blockchain's immutable storage capabilities, the phrase \"code is law\" is coined. Here, software is referred to by another name: \"smart contracts\".",{"type":21,"tag":22,"props":529,"children":530},{},[531],{"type":26,"value":532},"However, ahem, interrupting for a moment. The idea is beautiful, but reality can be cruel. In the early Ethereum community, there was indeed a desire to create a \"world computer,\" establishing a decentralized infrastructure distributed worldwide. But Ethereum's architecture has certain limitations, including lower transaction execution performance, high gas fees due to rising ETH prices, poor scalability, and the inability to store large amounts of data, among other issues.",{"type":21,"tag":28,"props":534,"children":535},{},[],{"type":21,"tag":22,"props":537,"children":538},{},[539],{"type":26,"value":540},"The solution to this problem can take two approaches. The first is to improve the existing architecture, such as transitioning Ethereum's consensus from PoW to PoS (Casper), building shard chains, or creating sidechains. The other approach is to start over and design a new architecture that can handle information processing and large-scale data storage at high speeds.",{"type":21,"tag":22,"props":542,"children":543},{},[544],{"type":26,"value":545},"The question is whether to keep improving and scaling the old Ethereum architecture or design a new \"world computer\" from scratch.",{"type":21,"tag":28,"props":547,"children":548},{},[],{"type":21,"tag":22,"props":550,"children":551},{},[552],{"type":26,"value":553},"In the face of these challenges, Dominic made a difficult decision and chose the latter option.",{"type":21,"tag":22,"props":555,"children":556},{},[557,559,564,566,570],{"type":26,"value":558},"Now we can see from Dominic's presentation at devcon one in 2015 that he described the IC as Ethereum 3.0. In fact, it wouldn't be too much to call it Blockchain 3.0. If Bitcoin and Ethereum are called \"Blockchain 1.0\" and \"Blockchain 2.0\", he wanted to create a \"",{"type":21,"tag":466,"props":560,"children":561},{},[562],{"type":26,"value":563},"solid",{"type":26,"value":565},"\", a true world computer, even naming the project the Internet Computer (IC for short). Based on the \"face\" to support large-scale applications, it can horizontally expand and achieve unlimited scalability as a \"",{"type":21,"tag":466,"props":567,"children":568},{},[569],{"type":26,"value":514},{"type":26,"value":571},"\".",{"type":21,"tag":88,"props":573,"children":577},{"src":574,"alt":575,"style":576},"https://s1.imagehub.cc/images/2023/01/26/d566e01d9397ce368f777127001a237c.png","图片","zoom:57%;",[],{"type":21,"tag":22,"props":579,"children":580},{},[581],{"type":26,"value":582},"Oops, wrong picture. The one below is IC.",{"type":21,"tag":88,"props":584,"children":586},{"src":585,"alt":88,"style":342},"https://s1.imagehub.cc/images/2023/01/26/d600d44cc130bd67f9daad687a0db40c.png",[],{"type":21,"tag":28,"props":588,"children":589},{},[],{"type":21,"tag":22,"props":591,"children":592},{},[593],{"type":26,"value":594},"The opportunity finally arrived in November 2015, in London.",{"type":21,"tag":22,"props":596,"children":597},{},[598],{"type":26,"value":599},"Dominic presented the consensus algorithm he had been studying at devcon one.",{"type":21,"tag":88,"props":601,"children":603},{"src":602,"style":386},"https://s1.imagehub.cc/images/2023/01/26/93504674b2894befb3c529b248726f50.png",[],{"type":21,"tag":22,"props":605,"children":606},{},[607],{"type":26,"value":608},"During the conversation, Dominic discovered that even the staunchest Bitcoin supporters were very interested in the concept of Ethereum. This reinforced his belief in the potential of Trusted Computing.",{"type":21,"tag":22,"props":610,"children":611},{},[612],{"type":26,"value":613},"Dominic had an even grander vision than Ethereum. He wanted to create a public network of servers that would provide a \"decentralized cloud\" - a trusted computing platform. Software would be deployed and run on this decentralized cloud.",{"type":21,"tag":88,"props":615,"children":617},{"src":616,"style":386},"https://s1.imagehub.cc/images/2023/01/26/73d313475c9ef0586de3a71b9b05f7c5.png",[],{"type":21,"tag":22,"props":619,"children":620},{},[621],{"type":26,"value":622},"Dominic is working on reshaping a completely decentralized infrastructure, which can also be understood as the next generation of internet infrastructure or as a decentralized trusted computing platform combined with blockchain😉.",{"type":21,"tag":28,"props":624,"children":625},{},[],{"type":21,"tag":22,"props":627,"children":628},{},[629],{"type":26,"value":630},"Simply put:",{"type":21,"tag":22,"props":632,"children":633},{},[634],{"type":26,"value":635},"Traditional defense systems: mainly composed of firewalls, intrusion detection, virus prevention, etc. The principle of traditional network security is passive defense, often \"treatment after the event\". For example, when an application has a virus, it is necessary to use anti-virus software to detect and kill it. At this time, the enterprise has already incurred losses to some extent.",{"type":21,"tag":22,"props":637,"children":638},{},[639],{"type":26,"value":640},"Trusted computing: based on cryptographic computation and protection, combined with secure technology to ensure full traceability and monitoring. The principle of trusted computing is active defense. Since the entire chain from application, operating system to hardware must be verified, the probability of virus and network attacks is greatly reduced.",{"type":21,"tag":28,"props":642,"children":643},{},[],{"type":21,"tag":22,"props":645,"children":646},{},[647],{"type":26,"value":648},"Blockchain has something called a consensus algorithm, which is responsible for coordinating the nodes in the network (a node is a group of servers, which can be understood as a high-performance computer). The consensus algorithm can ensure that everyone's information in the network is in agreement, because this is a network that anyone can join or leave at any time, and it is not known which node might intentionally disrupt it (you can refer to my future blog post about the Byzantine Generals problem). With the consensus algorithm, even if one-third of the nodes in the network are malicious, the other nodes can still reach a consensus normally (the resistance of different consensus algorithms varies).",{"type":21,"tag":88,"props":650,"children":654},{"src":651,"alt":652,"style":653},"https://s1.imagehub.cc/images/2023/01/26/66123e0ee39269d5c51bd0bcb69bf024.png","image-20230124221621784","zoom:30%;",[],{"type":21,"tag":22,"props":656,"children":657},{},[658],{"type":26,"value":659},"Decentralized platforms not only involve token transfers between parties, but also rely on consensus algorithms to establish a barrier and keep malicious actors at bay. However, efficiency and decentralization are difficult to achieve simultaneously, and it's challenging to create a fully decentralized system that can both protect nodes and allow for coordination and data synchronization among them. Dominic's goal is to merge trusted computing and blockchain to create a limitless, open, high-performance, strongly consistent, scalable, and data-intensive blockchain network composed of servers from all over the world, without the need for firewalls.",{"type":21,"tag":22,"props":661,"children":662},{},[663],{"type":26,"value":664},"For Dominic, the future of blockchain is the future of the internet, and vice versa. The internet is no longer just about connecting servers in data centers to users, but first forming a trusted and secure blockchain network composed of servers from around the world, and then deploying apps and serving users on top of it. Dominic hopes that banking and finance, the sharing economy (such as Uber), social networks, email, and even web searches can all be transferred to such a network.",{"type":21,"tag":28,"props":666,"children":667},{},[],{"type":21,"tag":22,"props":669,"children":670},{},[671],{"type":26,"value":672},"In the fall of 2016, Dominic announced his return as a \"decentralized adventurer\". With the theoretical framework in place, the adventure of a dreamer has officially begun!",{"type":21,"tag":28,"props":674,"children":675},{},[],{"type":21,"tag":32,"props":677,"children":679},{"id":678},"dfinity",[680],{"type":26,"value":681},"Dfinity !",{"type":21,"tag":22,"props":683,"children":684},{},[685],{"type":26,"value":686},"IC re-designed the blockchain architecture and developed more efficient consensus, along with innovative cryptographic combinations, in order to achieve the idea of a \"world computer\". The goal is to solve the limitations of speed, efficiency, and scalability in traditional blockchain architectures.",{"type":21,"tag":28,"props":688,"children":689},{},[],{"type":21,"tag":22,"props":691,"children":692},{},[693],{"type":26,"value":694},"Dominic is busy researching with the technical team on his left hand, writing strategic plans for the team on his right hand, and going to various blockchain forums to introduce the project with his mouth.",{"type":21,"tag":88,"props":696,"children":700},{"src":697,"alt":698,"style":699},"https://s1.imagehub.cc/images/2023/01/28/fb974c47245d325b1defc2ac8865e7ec.jpeg","DGRaEBfUIAAvYvY","zoom:15%;",[],{"type":21,"tag":22,"props":702,"children":703},{},[704],{"type":26,"value":705},"Over the years, Dominic has shared many critical cryptographic technologies with other blockchain teams, such as the application of VRF, which has been adopted by many well-known projects (such as Chainlink, etc.).",{"type":21,"tag":22,"props":707,"children":708},{},[709],{"type":26,"value":710},"In February 2017, Dominic participated in a roundtable forum with Vitalik Buterin and many other experts. From left to right: Vitalik Buterin (left one), Dominic (left two), Timo Hanke (right one).",{"type":21,"tag":88,"props":712,"children":715},{"src":713,"alt":714,"style":151},"https://s1.imagehub.cc/images/2023/01/26/99e283e435820e746ca62048059b4909.png","FfGddz-XoAA9SzO",[],{"type":21,"tag":28,"props":717,"children":718},{},[],{"type":21,"tag":22,"props":720,"children":721},{},[722],{"type":26,"value":723},"Ben Lynn (second from left in the red T-shirt) is demonstrating a mind-blowing technology called Threshold Relay, which can significantly improve the performance of blockchain and quickly generate blocks.",{"type":21,"tag":88,"props":725,"children":728},{"src":726,"alt":575,"style":727},"https://s1.imagehub.cc/images/2023/01/26/63cf9b6bfe37c841fae4da90b0004c1a.jpeg","zoom: 27%;",[],{"type":21,"tag":22,"props":730,"children":731},{},[732],{"type":26,"value":733},"By the way, engineer Timo Hanke (third from left in the middle) was a mathematics and cryptography professor at RWTH Aachen University in Germany before he created AsicBoost in 2013, which increased the efficiency of Bitcoin mining by 20-30% and is now a standard for large-scale mining operations.",{"type":21,"tag":22,"props":735,"children":736},{},[737],{"type":26,"value":738},"Ben Lynn is one of the creators of the BLS signature algorithm, and the \"L\" in BLS stands for the \"L\" in his name. After graduating from Stanford with a Ph.D., he worked at Google for 10 years before joining Dfinity in May 2017. If you haven't heard of the BLS algorithm, you must have read Ben Lynn's \"Git Magic,\" which was all the rage on the internet a few years ago.",{"type":21,"tag":88,"props":740,"children":742},{"src":741,"style":576},"https://s1.imagehub.cc/images/2023/03/12/fed23c8e27a52bd194abd072f602c2d3.png",[],{"type":21,"tag":28,"props":744,"children":745},{},[],{"type":21,"tag":22,"props":747,"children":748},{},[749],{"type":26,"value":750},"Dfinity aims to explore the future infrastructure of the internet. To talk about this, we need to start with Bitcoin.",{"type":21,"tag":22,"props":752,"children":753},{},[754],{"type":26,"value":755},"Bitcoin is completely virtual. It has no intrinsic value and cannot create any value. It is just a digital currency. Why do people go crazy and spend money to buy Bitcoin? Let's dig a little deeper into why Bitcoin exists in the first place.",{"type":21,"tag":22,"props":757,"children":758},{},[759],{"type":26,"value":760},"Bitcoin was born in the context of the 2008 financial crisis. The crisis had a global impact, and no country could stand alone. Fiat currencies became unreliable. Imagine the relationship behind this: governments issue legal tender backed by national credit. But the world is not always peaceful and stable. Wars, natural disasters, and financial crises can all affect society, which in turn affects the economy.",{"type":21,"tag":28,"props":762,"children":763},{},[],{"type":21,"tag":22,"props":765,"children":766},{},[767],{"type":26,"value":768},"Regarding wars: society depends on the government, which controls the military to maintain social order, and taxes are collected to support the military. If the benefits of conflicts between nations outweigh the costs, then war may occur. The people pay taxes to support the military and fight the war. When the guns go off, gold is worth ten thousand taels. Some countries profit, while others lose money.",{"type":21,"tag":22,"props":770,"children":771},{},[772],{"type":26,"value":773},"Regarding finance: most countries in the world, including Europe and North America, have economic cycles. Small cycles make up large ones, like sine waves. Periodic financial crises are like a sword hanging over our heads, and we can only pray that we will be spared.",{"type":21,"tag":22,"props":775,"children":776},{},[777],{"type":26,"value":778},"Regarding nature: natural disasters are unpredictable. Although with the development of technology, the impact of natural disasters on humanity is becoming smaller. Viruses, floods, and volcanoes. However, there are still many threats in the next few decades. At that time, the economy will naturally be affected.",{"type":21,"tag":28,"props":780,"children":781},{},[],{"type":21,"tag":22,"props":783,"children":784},{},[785],{"type":26,"value":786},"Since everything affects the economy, can't we find something that doesn't affect it? Well, the economy is all about money! We just need to find a currency that does not depreciate. We don't need to resist all crises, as long as this currency can withstand some disasters and calamities. Money, oh money, please don't let financial crises on one side of the earth affect the normal lives of people on the other side.",{"type":21,"tag":28,"props":788,"children":789},{},[],{"type":21,"tag":22,"props":791,"children":792},{},[793],{"type":26,"value":794},"Oh my god. There really is such a magical thing.",{"type":21,"tag":22,"props":796,"children":797},{},[798],{"type":26,"value":799},"This kind of money comes from an anarchist ideology. The b-money mentioned earlier embodies this kind of thinking.",{"type":21,"tag":22,"props":801,"children":802},{},[803],{"type":26,"value":804},"The basic position of anarchism is to oppose all forms of rule and authority, including the government, advocating for self-help relationships between individuals, and focusing on individual freedom and equality. For anarchists, the term \"anarchy\" does not represent chaos, nothingness, or moral decay, but rather a harmonious society established by free individuals who voluntarily come together to establish mutual aid, self-governance, and anti-dictatorship. It is an anarchist but authoritative system.",{"type":21,"tag":22,"props":806,"children":807},{},[808],{"type":26,"value":809},"They believe that the root cause lies in the \"government\" and the current top-down pyramid structure. The hierarchical management model not only has problems of inaction, corruption, and waste, but more importantly, there is always an organization managing everyone and maintaining order, which can easily lead to war due to major conflicts of interest.",{"type":21,"tag":811,"props":812,"children":813},"ul",{},[814,820,825,830],{"type":21,"tag":815,"props":816,"children":817},"li",{},[818],{"type":26,"value":819},"Further analysis shows that primitive society was very peaceful. People naturally gathered in the form of extended families to hunt and cooperate together. There was no such thing as government and nation, only small-scale wealth accumulation and division of labor, and there were no laws and police. Because primitive society had no private property, everyone was a naked, running and jumping piece of meat.",{"type":21,"tag":815,"props":821,"children":822},{},[823],{"type":26,"value":824},"Later, with the emergence of private property, violence arose. The reason is simple, because it was profitable. By using violence to plunder wealth, there were \"brave men\" who were willing to do it.",{"type":21,"tag":815,"props":826,"children":827},{},[828],{"type":26,"value":829},"Afterwards, when there were a large number of profit-making organizations, someone would come forward to protect everyone. A violent organization to prevent violence emerged -- the army. Everyone could pay a little money (taxes) to get protection. In order to provide protection services more efficiently, people formed governments. Everyone deposits money in banks because banks can provide protection: vaults, safe deposit boxes, security guards, police, etc. This system depends on government operation, and banks and police either accept government supervision or are established by the government. I don't carry my money with me, it's in the bank, haha, you can't rob me.",{"type":21,"tag":815,"props":831,"children":832},{},[833],{"type":26,"value":834},"As a result, two large organizations (the government) will launch larger-scale wars due to conflicts of collective interests, if the benefits are greater than the cost of starting a war. They recruit more troops to protect collective property... The violence conflict is getting bigger and bigger, where is the peace? Nuclear deterrence. This is not peace, but fear of being destroyed by nuclear weapons. But it can be considered a kind of peace.",{"type":21,"tag":28,"props":836,"children":837},{},[],{"type":21,"tag":22,"props":839,"children":840},{},[841],{"type":26,"value":842},"In the 21st century, people's wealth, including social and entertainment, has gradually shifted to the internet. Therefore, the organizations that protect people's property have also moved online: online banking, Paypal, Alipay:“No problem, put your money with us, hehe. Just pay a handling fee, hehe.”",{"type":21,"tag":22,"props":844,"children":845},{},[846],{"type":26,"value":847},"And the protection organization helps everyone keep their money safe! Even wars have become network defense battles, with protection organizations and hackers fighting back and forth, desperately protecting everyone's money.",{"type":21,"tag":22,"props":849,"children":850},{},[851],{"type":26,"value":852},"In the past, protection organizations only provided physical protection and did not station troops in your home. But online, it's different. Your data is transmitted directly to the server. My data is also my asset! Data contains privacy, property, what you bought today, who you like to chat with, what you like to watch, what you want to eat tonight...all of which can be analyzed through data. This is like having a \"network army\" stationed in your home, monitoring your every move. And how the data is processed, they have the final say. Because the protection organization controls the server, they can delete it directly if they think it's not good or harmful to someone, without your consent.",{"type":21,"tag":28,"props":854,"children":855},{},[],{"type":21,"tag":22,"props":857,"children":858},{},[859],{"type":26,"value":860},"Can we flatten the \"pyramid\" and build a \"personal sovereignty\" system that does not rely on protection organizations? Where each person represents equality and independence?",{"type":21,"tag":22,"props":862,"children":863},{},[864],{"type":26,"value":865},"Yes, it is possible. There is a way for you to securely hold your own private property. You don't need banks to protect your wealth, you don't need safes to protect them, and you don't need protection organizations. You can keep it yourself.",{"type":21,"tag":22,"props":867,"children":868},{},[869],{"type":26,"value":870},"How can one person protect their property? The answer is to use modern cryptography to protect it through mathematics!",{"type":21,"tag":22,"props":872,"children":873},{},[874],{"type":21,"tag":466,"props":875,"children":876},{},[877],{"type":26,"value":878},"Though a bomb may rend a safe's hard shell, The secrets of cryptography it cannot dispel!",{"type":21,"tag":22,"props":880,"children":881},{},[882],{"type":26,"value":883},"Bitcoin is this kind of money! Generate your own private key, and as long as the private key is not leaked, no one can steal your bitcoin. Sending and receiving bitcoin is done peer-to-peer without relying on a centralized platform (bank). Of course, if the private key is lost, the bitcoin will be lost forever.",{"type":21,"tag":22,"props":885,"children":886},{},[887],{"type":26,"value":888},"Your own private key, controlling your own data, independent of third parties, perfect.",{"type":21,"tag":28,"props":890,"children":891},{},[],{"type":21,"tag":22,"props":893,"children":894},{},[895],{"type":26,"value":896},"Is Bitcoin absolutely safe? Of course not. If you want to steal someone's bitcoin, you can hold a knife to their neck and make them give you their private key. Whoever has the private key owns the bitcoin, and the encryption algorithm only recognizes the private key.",{"type":21,"tag":22,"props":898,"children":899},{},[900,902],{"type":26,"value":901},"This is the charm of decentralization. ",{"type":21,"tag":466,"props":903,"children":904},{},[905],{"type":26,"value":906},"We trust Bitcoin not because Satoshi Nakamoto won't sell his massive amount of bitcoin, but because we believe in personal sovereignty and cryptography.",{"type":21,"tag":28,"props":908,"children":909},{},[],{"type":21,"tag":22,"props":911,"children":912},{},[913],{"type":26,"value":914},"And so, a fundamental change began to take place in the world of the internet:",{"type":21,"tag":22,"props":916,"children":917},{},[918],{"type":26,"value":919},"Bitcoin was a new type of electronic money that enabled personal wealth without relying on any individual, organization, or government, but instead relied on completely open and transparent cryptography. Ethereum built a new type of computer on top of Bitcoin, running on a decentralized virtual computer spread across the globe. It is immutable, cannot be shut down by governments, and is not controlled by any government. It is a network composed of people from different regions, races, and lifestyles. Unless the United Nations shuts down the internet on Earth, this decentralized organization will continue to exist.",{"type":21,"tag":28,"props":921,"children":922},{},[],{"type":21,"tag":22,"props":924,"children":925},{},[926],{"type":26,"value":927},"However, the network speed that almost all electronic devices can join is too slow. Just think about it, early on, any computer could join the Bitcoin network for mining, but now, as more and more people mine Bitcoin, and the hash difficulty rises, people have to purchase more powerful graphics cards and combine more computers for mining, which is like a decentralized server room.",{"type":21,"tag":22,"props":929,"children":930},{},[931],{"type":26,"value":932},"Dominic thought, why not just let data center server rooms act as nodes, which would also improve performance!",{"type":21,"tag":22,"props":934,"children":935},{},[936],{"type":26,"value":937},"So IC became a \"data center chain,\" a decentralized network composed of data centers around the world. While Ethereum excels in financial dapps, IC is good at general-purpose dapps. This enables a \"personal sovereignty\" revolution for various internet applications.",{"type":21,"tag":28,"props":939,"children":940},{},[],{"type":21,"tag":22,"props":942,"children":943},{},[944],{"type":26,"value":945},"2021 was not an ordinary year.",{"type":21,"tag":22,"props":947,"children":948},{},[949],{"type":26,"value":950},"May 10th. The IC mainnet was launched.",{"type":21,"tag":88,"props":952,"children":954},{"src":953,"alt":182,"style":653},"https://s1.imagehub.cc/images/2023/01/26/df5b4b83d7b278dd3fdb923135947a16.jpeg",[],{"type":21,"tag":22,"props":956,"children":957},{},[958],{"type":26,"value":959},"The chart above shows a comparison of performance, storage data costs, and energy consumption against other blockchains.",{"type":21,"tag":28,"props":961,"children":962},{},[],{"type":21,"tag":22,"props":964,"children":965},{},[966],{"type":26,"value":967},"When the IC mainnet went live, there were already over 4,000 active developers. The chart below shows the growth of developers compared to other blockchains.",{"type":21,"tag":88,"props":969,"children":971},{"src":970,"alt":575,"style":238},"https://s1.imagehub.cc/images/2023/01/26/fabf7f6e50771c50912dc419e9284f16.jpeg",[],{"type":21,"tag":28,"props":973,"children":974},{},[],{"type":21,"tag":28,"props":976,"children":977},{},[],{"type":21,"tag":22,"props":979,"children":980},{},[981],{"type":26,"value":982},"IC has many innovations, such as the ability to make direct HTTPS calls without an oracle, full-stack deployment on-chain, direct scaling by adding more nodes, automatic governance of nodes by the Network Nervous System (NNS), reverse gas model, SNS DAO, native integration of Bitcoin, integration of Ethereum (not through a cross-chain bridge) ...",{"type":21,"tag":28,"props":984,"children":985},{},[],{"type":21,"tag":22,"props":987,"children":988},{},[989],{"type":26,"value":990},"On IC, the \"canister\" is equivalent to Ethereum's smart contract, or can be understood as a small virtual server/container that can store data and deploy code.",{"type":21,"tag":28,"props":992,"children":993},{},[],{"type":21,"tag":22,"props":995,"children":996},{},[997],{"type":26,"value":998},"Like Bitcoin, Ethereum has also adopted the paradigm of \"code is law\". This means that there is no governance to regulate the use of the platform or the underlying network itself. IC's \"smart contract\" canister is not immutable, and it can store data and update code.",{"type":21,"tag":28,"props":1000,"children":1001},{},[],{"type":21,"tag":22,"props":1003,"children":1004},{},[1005],{"type":26,"value":1006},"The Zurich office demonstrates the integration of Bitcoin on the whiteboard. Bitcoin transactions can be processed directly through canisters without the need for private keys. The integration of Ethereum is also coming soon.",{"type":21,"tag":88,"props":1008,"children":1011},{"src":1009,"style":1010},"https://s1.imagehub.cc/images/2023/01/26/6d6fa714d370a66d05a6c0d443c585b2.jpeg","zoom:77%;",[],{"type":21,"tag":22,"props":1013,"children":1014},{},[1015],{"type":26,"value":1016},"At the protocol level, IC is directly integrated with Bitcoin. Canisters on IC can receive, hold, and send Bitcoin directly on the Bitcoin network. This means canisters can hold Bitcoin like regular users. Canisters can securely hold and use ECDSA keys through the threshold ECDSA chain key signature protocol.",{"type":21,"tag":22,"props":1018,"children":1019},{},[1020],{"type":26,"value":1021},"In this regard, IC is the first to directly integrate other blockchain networks using magical cryptography.",{"type":21,"tag":28,"props":1023,"children":1024},{},[],{"type":21,"tag":22,"props":1026,"children":1027},{},[1028],{"type":26,"value":1029},"The IC architecture and consensus mechanism are innovative and unparalleled in their sophistication. IC theoretically has unlimited computing and storage capacity, as long as new server nodes are constantly added. The improved consensus is somewhat similar to Practical Byzantine Fault Tolerance, but more complex and different from existing consensus mechanisms. Dominic named it \"Proof of Useful Work\" (PoUW) consensus. The BLS threshold signature scheme's VRF generates truly unpredictable random numbers, which can be verified by everyone to ensure they are not counterfeit. The edge nodes are resistant to sybil attacks, and the layered architecture and randomly designated block production are all simply marvelous.",{"type":21,"tag":28,"props":1031,"children":1032},{},[],{"type":21,"tag":22,"props":1034,"children":1035},{},[1036],{"type":26,"value":1037},"According to statistics from GitHub and Electric Capital (2023), IC has the most active developer community and is still growing rapidly.",{"type":21,"tag":88,"props":1039,"children":1041},{"src":1040,"alt":575,"style":299},"https://s1.imagehub.cc/images/2023/01/26/616e010d7ec8b2eb236d023004f8ead4.jpeg",[],{"type":21,"tag":28,"props":1043,"children":1044},{},[],{"type":21,"tag":22,"props":1046,"children":1047},{},[1048],{"type":26,"value":1049},"The photo on the office wall when IC was about to reach 30 million blocks after three weeks of mainnet launch.",{"type":21,"tag":88,"props":1051,"children":1053},{"src":1052,"alt":575,"style":386},"https://s1.imagehub.cc/images/2023/01/26/f78783b11cb609cfb3545381525ee787.jpeg",[],{"type":21,"tag":28,"props":1055,"children":1056},{},[],{"type":21,"tag":22,"props":1058,"children":1059},{},[1060],{"type":26,"value":1061},"In July 2021, many new Dfinity members interviewed and joined the team via video conferencing during the COVID-19 pandemic without meeting in person. On this day, a small group of people came to the office located in Zurich to meet face-to-face.",{"type":21,"tag":88,"props":1063,"children":1066},{"src":1064,"alt":575,"style":1065},"https://s1.imagehub.cc/images/2023/01/26/3adc64294313d748a0fe347ee81007b3.jpeg","zoom:17%;",[],{"type":21,"tag":28,"props":1068,"children":1069},{},[],{"type":21,"tag":22,"props":1071,"children":1072},{},[1073],{"type":26,"value":1074},"Dominic has written two visions for Dfinity in his blog:",{"type":21,"tag":22,"props":1076,"children":1077},{},[1078],{"type":26,"value":1079},"On the one hand, many traditional monopolistic technology intermediaries, such as Uber, eBay, social networks, instant messaging, and even search engines, may be redesigned as \"open-source enterprises,\" using proprietary software and their own decentralized governance systems to update themselves.",{"type":21,"tag":22,"props":1081,"children":1082},{},[1083],{"type":26,"value":1084},"On the other hand, we hope to see large-scale redesign of enterprise IT systems to take advantage of the special properties offered by blockchain computers and dramatically reduce costs. The last point is not obvious, as computing on blockchain computers is much more expensive than traditional cloud computing such as Amazon Web Services. However, significant cost savings are possible because the vast majority of costs involved in running enterprise IT systems come from supporting human capital, not computing itself, and IC will make it possible to create systems with much less human capital involvement.",{"type":21,"tag":28,"props":1086,"children":1087},{},[],{"type":21,"tag":22,"props":1089,"children":1090},{},[1091],{"type":26,"value":1092},"Image from Shanghai, October 2021.",{"type":21,"tag":88,"props":1094,"children":1097},{"src":1095,"alt":182,"style":1096},"https://s1.imagehub.cc/images/2023/01/26/2cea7849c09de6aadd133bf5337ec7fa.jpeg","zoom:55%;",[],{"type":21,"tag":28,"props":1099,"children":1100},{},[],{"type":21,"tag":22,"props":1102,"children":1103},{},[1104,1106,1113],{"type":26,"value":1105},"On July 14, 2022, at a street café in Zurich, Dominic and his team were waiting for the 1,000,000,000th block of IC to be mined, while checking the real-time statistics of IC data on the ",{"type":21,"tag":270,"props":1107,"children":1110},{"href":1108,"rel":1109},"https://dashboard.internetcomputer.org/",[274],[1111],{"type":26,"value":1112},"dashboard",{"type":26,"value":1114},".",{"type":21,"tag":88,"props":1116,"children":1118},{"src":1117,"alt":575,"style":238},"https://s1.imagehub.cc/images/2023/01/26/6de3ff8a4d75d9964afa8252433562c7.jpeg",[],{"type":21,"tag":28,"props":1120,"children":1121},{},[],{"type":21,"tag":22,"props":1123,"children":1124},{},[1125],{"type":26,"value":1126},"DFINITY's new office building is located in Switzerland.",{"type":21,"tag":88,"props":1128,"children":1130},{"src":1129,"style":91},"https://s1.imagehub.cc/images/2023/01/26/03c4efa5b588d05bc594c6c98b5ef081.png",[],{"type":21,"tag":28,"props":1132,"children":1133},{},[],{"type":21,"tag":22,"props":1135,"children":1136},{},[1137],{"type":26,"value":1138},"When leaving the office, Dominic took some photos of murals on the cafeteria wall that were created by talented IC NFT artists.",{"type":21,"tag":88,"props":1140,"children":1143},{"src":1141,"style":1142},"https://s1.imagehub.cc/images/2023/01/28/55079229adecb6dd5c35d8ad1fc84cd9.jpeg","zoom:20%;",[],{"type":21,"tag":22,"props":1145,"children":1146},{},[1147],{"type":26,"value":1148},"Dominic moved into his new house, and shared the good news on Twitter while enjoying a piece of cake.",{"type":21,"tag":88,"props":1150,"children":1152},{"src":1151,"alt":575,"style":151},"https://s1.imagehub.cc/images/2023/01/26/f9803e7660dbfa51bc918b50e92a3e91.jpeg",[],{"type":21,"tag":22,"props":1154,"children":1155},{},[1156],{"type":26,"value":1157},"After work, one must not neglect their musical pursuits.",{"type":21,"tag":88,"props":1159,"children":1163},{"src":1160,"alt":1161,"style":1162},"https://s1.imagehub.cc/images/2023/01/26/88fefffafff481e6a74b511e629f2fc5.png","image-20230124235301028","zoom:70%;",[],{"type":21,"tag":28,"props":1165,"children":1166},{},[],{"type":21,"tag":88,"props":1168,"children":1170},{"src":1169,"style":238},"https://s1.imagehub.cc/images/2023/01/26/d906dc0876066d58bf33d4a2c619bc20.png",[],{"type":21,"tag":28,"props":1172,"children":1173},{},[],{"type":21,"tag":22,"props":1175,"children":1176},{},[1177],{"type":26,"value":1178},"Switzerland is now a prominent \"Crypto Valley\", where many well-known blockchain projects have been born. Dfinity is the first completely non-profit foundation here.",{"type":21,"tag":22,"props":1180,"children":1181},{},[1182],{"type":26,"value":1183},"Dominic has assembled a very strong team of blockchain developers, including cryptography, computer science, and mathematics professors, PhDs and postdocs, cryptocurrency experts, senior engineers, and professional managers.",{"type":21,"tag":22,"props":1185,"children":1186},{},[1187],{"type":26,"value":1188},"I believe that blockchain will still be one of the most interesting, influential, and fastest-growing technology fields in the next 10 years. Currently, there is no other chain better suited for deploying applications than IC.",{"type":21,"tag":28,"props":1190,"children":1191},{},[],{"type":21,"tag":28,"props":1193,"children":1194},{},[],{"type":21,"tag":22,"props":1196,"children":1197},{},[1198],{"type":26,"value":1199},"This is the story I wanted to tell about Dominic, but his own story is far from over, and has just begun...",{"type":21,"tag":22,"props":1201,"children":1202},{},[1203],{"type":26,"value":1204},"Who could have imagined that a blog post from distant 1998 would ignite the \"crypto movement\" that has been sweeping the world for the past twenty years, fueled by Dominic's passion for unlimited distribution...",{"type":21,"tag":22,"props":1206,"children":1207},{},[1208],{"type":26,"value":1209},"That was a new world.",{"type":21,"tag":28,"props":1211,"children":1212},{},[],{"type":21,"tag":28,"props":1214,"children":1215},{},[],{"type":21,"tag":28,"props":1217,"children":1218},{},[],{"type":21,"tag":28,"props":1220,"children":1221},{},[],{"type":21,"tag":28,"props":1223,"children":1224},{},[],{"type":21,"tag":1226,"props":1227,"children":1229},"h3",{"id":1228},"epilogue",[1230],{"type":26,"value":1231},"Epilogue",{"type":21,"tag":22,"props":1233,"children":1234},{},[1235],{"type":26,"value":1236},"After completing the conclusion, I perceived a faint disturbance. The rustling, rustling sound approached gradually, rendering the entire room utterly silent. The source of the sound remained indistinct and unfathomable - it could have been the hum of the computer's fan, the gentle sway of tree branches outside the window, or simply a figment of my own imagination.",{"type":21,"tag":22,"props":1238,"children":1239},{},[1240],{"type":26,"value":1241},"The sound became clearer and clearer. It sounded like it was coming from inside the computer?",{"type":21,"tag":22,"props":1243,"children":1244},{},[1245],{"type":26,"value":1246},"I hurriedly pressed my ear against the computer's motherboard, but the sound did not emanate from there. I turned my gaze towards the window - could it be coming from outside? Yet everything outside appeared perfectly normal.",{"type":21,"tag":22,"props":1248,"children":1249},{},[1250],{"type":26,"value":1251},"Then the sound came again, louder this time. It was a buzzing sound! That's it!",{"type":21,"tag":22,"props":1253,"children":1254},{},[1255],{"type":26,"value":1256},"Suddenly, time came to a standstill. Everything around me froze in place. Neurons expanded and burst, releasing pheromones that catalyzed other neurons. My head began to shake uncontrollably, then suddenly expanded. My eyes bulged like a mouse's, and my ears twisted into pretzels... The sound seemed to be accompanied by the sound of breaking glass, footsteps on the ground, and the sound of birds and dogs barking...",{"type":21,"tag":88,"props":1258,"children":1261},{"src":1259,"alt":1260,"style":151},"https://s1.imagehub.cc/images/2023/01/26/cfc9f9909024db41734c7a23eb881472.jpeg","123",[],{"type":21,"tag":22,"props":1263,"children":1264},{},[1265],{"type":26,"value":1266},"A burst of white light coursed through my mind, quickly swelling into a vast, shimmering expanse of brilliance. All around me, an endless canvas of blue unfurled, adorned with intricate squares and lines of every hue. Then, a radiant spark flickered to life, blossoming into a majestic orb that engulfed all else in its path. As the light dissipated, the blue canvas gave way to an immaculate vista of pristine white.",{"type":21,"tag":28,"props":1268,"children":1269},{},[],{"type":21,"tag":22,"props":1271,"children":1272},{},[1273],{"type":26,"value":1274},"Now, I don't remember anything.",{"type":21,"tag":22,"props":1276,"children":1277},{},[1278],{"type":26,"value":1279},"Maybe it was just a dream.",{"type":21,"tag":22,"props":1281,"children":1282},{},[1283],{"type":26,"value":1284},"Or maybe it was something that could change the world.",{"type":21,"tag":28,"props":1286,"children":1287},{},[],{"type":21,"tag":28,"props":1289,"children":1290},{},[],{"type":21,"tag":28,"props":1292,"children":1293},{},[],{"title":7,"searchDepth":1295,"depth":1295,"links":1296},2,[1297,1298,1299,1300],{"id":34,"depth":1295,"text":37},{"id":255,"depth":1295,"text":258},{"id":443,"depth":1295,"text":446},{"id":678,"depth":1295,"text":681,"children":1301},[1302],{"id":1228,"depth":1303,"text":1231},3,"markdown","content:blog:Journey of the Dream Weaver.md","content","blog/Journey of the Dream Weaver.md","blog/Journey of the Dream Weaver","md",1740805742510]